[{"rating": "91", "roaster": "Buon Caffe", "title": "Ethiopia Yirgacheffe Elatenecha Natural G1", "blind assessment": "Crisply citrusy. Sweet lime, baking chocolate, goji berry, fir, caramel in aroma and cup. Sweetly brisk acidity; crisp, velvety mouthfeel. Gently drying finish with notes of citrus and fir.", "notes": "Produced by Burtukan Geremu, from local heirloom varieties of Arabica, and processed by the natural method (dried in the whole fruit). Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.", "bottom line": "A friendly, accessible natural-processed Guji with appealing citrus and gentle chocolate notes throughout.", "Roaster Location:": "Taipei, Taiwan", "Coffee Origin:": "Yirgacheffe growing region, south-central Ethiopia", "Roast Level:": "Light", "Agtron:": "64/82", "Est. Price:": "NT $379/8 ounces", "Review Date:": "November 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-elatenecha-natural-g1/"}, {"rating": "92", "roaster": "Buon Caffe", "title": "Ethiopia Sidamo Bensa Hamasho Washed G1", "blind assessment": "Crisply sweet, floral-toned. Nutella, magnolia, nectarine, lime zest, cedar in aroma and cup. Sweet structure with bright, balanced acidity; velvety-smooth mouthfeel. Crisp, floral-toned finish.", "notes": "Produced by Asefa Dukamo Korma, entirely of the 74158 variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.", "bottom line": "A balanced, comfortable, sweet-toned Ethiopia cup with a Nutella-like sweetness throughout.", "Roaster Location:": "Taipei, Taiwan", "Coffee Origin:": "Sidamo growing region, south-central Ethiopia", "Roast Level:": "Light", "Agtron:": "66/82", "Est. Price:": "NT $399/8 ounces", "Review Date:": "November 2023", "Aroma:": "8", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-sidamo-bensa-hamasho-washed-g1/"}, {"rating": "91", "roaster": "Buon Caffe", "title": "Ecuador Clara Luz Washed", "blind assessment": "Richly sweet-savory. Baking chocolate, red plum, nougat, cedar, hop flowers in aroma and cup. Brisk acidity; crisp, velvety mouthfeel. The wood-framed finish is supported by baking chocolate.", "notes": "Produced by Servio Lenin González Jiménez of Clara Luz Farm, entirely of the Sidra variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Buon Caffe is a specialty coffee roaster and cafe in Taipei, Taiwan. Visit www.buoncaffe.com.tw for more information.", "bottom line": "A crisply chocolaty Ecuador complicated by bittersweet hop-like florals.", "Roaster Location:": "Taipei, Taiwan", "Coffee Origin:": "Quilanga, Loja Province, Ecuador", "Roast Level:": "Medium-Light", "Agtron:": "58/76", "Est. Price:": "NT $698/100 grams", "Review Date:": "November 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/ecuador-clara-luz-washed/"}, {"rating": "93", "roaster": "Index Coffee Roasters", "title": "Brazil Admilson Jose Galerani Microlot", "blind assessment": "Balanced, fruit-toned. Dried black cherry, almond nougat, sassafras, oak, lilac in aroma and cup. Bright, winey acidity; lightly satiny mouthfeel. Crisply sweet-tart finish with notes of black cherry and almond.", "notes": "Produced by Admilson Jose Galerani on his 7-hectare farm, entirely of the Yellow Catuai variety of Arabica, and processed by the natural method (dried in the whole fruit). Index Coffee Roasters is a specialty roaster based in Fairfax, Virginia. Visit www.indexcoffee.com for more information.", "bottom line": "Dried stonefruit and rich almond nougat characterize this natural-processed Brazil with wine-like acidity.", "Roaster Location:": "Fairfax, Virginia", "Coffee Origin:": "Mogiana growing region, Sao Paulo State, Brazil", "Roast Level:": "Light", "Agtron:": "62/80", "Est. Price:": "$19.75/12 ounces", "Review Date:": "October 2023", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/brazil-admilson-jose-galerani-microlot/"}, {"rating": "93", "roaster": "Yi-Chi Coffee", "title": "Colombia Geisha Charlotte", "blind assessment": "Delicately bright, stone fruit-driven. Apricot, almond, orange zest, cedar, maple syrup in aroma and cup. Juicy, balanced acidity; crisp, satiny mouthfeel. Finish consolidates to notes of apricot and almond with cedar undertones.", "notes": "Produced by smallholding farmers , entirely of the Geisha variety of Arabica, and processed by the traditional washed method (fruit skin and flesh are removed before drying). Yi-Chi Coffee is a specialty roaster in Changua, Taiwan. Visit https://www.facebook.com/profile.php?id=100089735716928 for more information.", "bottom line": "This washed Colombia Geisha leads with notes of bright stone fruit and gets ballast and depth from almond and cedar.", "Roaster Location:": "Changua, Taiwan", "Coffee Origin:": "Vera Province, Huila Department, Colombia", "Roast Level:": "Medium-Light", "Agtron:": "58/78", "Est. Price:": "NT $670/230 grams", "Review Date:": "October 2023", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/colombia-geisha-charlotte/"}, {"rating": "93", "roaster": "Kakalove Cafe", "title": "Guatemala Honey Acatenango Finca El General Bourbon", "blind assessment": "Sweet-toned, subtly nuanced. Almond butter, caramel apple, freesia, graham cracker, oak in aroma and cup. Brisk acidity; full, very satiny mouthfeel. Nutty finish supported by caramel notes.", "notes": "Produced at Finca El General, entirely of the Bourbon variety of Arabica, and processed by the honey method (some fruit flesh is left on the seed during the drying process). Kakalove Café is a nano-roaster located in the small city of Chia-Yi in Taiwan that strives to procure and roast the finest quality coffee. Visit www.kakalovecafe.com.tw or email [email protected] for more information.", "bottom line": "A solid Guatemala cup processed by the honey method: gently bright, balanced, delicately sweet, richly nut-toned.", "Roaster Location:": "Chia-Yi, Taiwan", "Coffee Origin:": "Acatenango, Chimaltenango, Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "58/74", "Est. Price:": "NT $280/8 ounces", "Review Date:": "September 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/guatemala-honey-acatenango-finca-el-general-bourbon/"}, {"rating": "93", "roaster": "Big Shoulders Coffee", "title": "Ecuador Maputo Honey", "blind assessment": "Delicately fruit-toned. Sweetly herbaceous. Lychee, star anise, lemon balm, oak, freesia in aroma and cup. Gentle, round acidity; full, syrupy-smooth mouthfeel. Finish consolidates to lychee and anise.", "notes": "Produced by Henry and Verena Gaibor of Finca Maputo, from trees of the Typica Mejorado variety of Arabica, and processed by the honey method, in which some fruit flesh is left on the beans during the drying process. Big Shoulders Coffee is a Chicago artisan roaster that emphasizes a fresh-roasted, no-nonsense approach to fine coffee. Visit www.bigshoulderscoffee.com or call 312-846-1439 for more information.", "bottom line": "An inviting honey-processed Ecuador that leads with tropical fruit and spicy floral notes with spice undertones.", "Roaster Location:": "Chicago, Illinois", "Coffee Origin:": "Pichincha, Ecuador", "Roast Level:": "Medium-Light", "Agtron:": "61/77", "Est. Price:": "$62.00/8 ounces", "Review Date:": "August 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ecuador-maputo-honey/"}, {"rating": "94", "roaster": "Big Shoulders Coffee", "title": "Ethiopia Yirgacheffe Farmgate", "blind assessment": "Delicately fruit-forward. Dried strawberry, cherry blossom, honey, sandalwood, tangerine zest in aroma and cup. Sweetly tart with balanced, fruit-toned acidity; very full, syrupy mouthfeel. Crisply berry-driven finish.", "notes": "Produced by Ageze Balcha Begna, from trees of indigenous landrace varieties of Arabica long grown in the region, and processed by the natural method (dried in the whole fruit). Big Shoulders Coffee is a Chicago artisan roaster that emphasizes a fresh-roasted, no-nonsense approach to fine coffee. Visit www.bigshoulderscoffee.com or call 312-846-1439 for more information.", "bottom line": "Berries and floral notes drive this natural-processed Ethiopia that remains light on its feet — delicate, balanced nicely between sweet and tart.", "Roaster Location:": "Chicago, Illinois", "Coffee Origin:": "Yirgacheffe growing region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "59/75", "Est. Price:": "$27.00/12 ounces", "Review Date:": "August 2023", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-farmgate/"}, {"rating": "91", "roaster": "Gee Coffee Roasters", "title": "Biodynamic Washed Geisha", "blind assessment": "Crisply sweet, gently floral. Apricot, magnolia, baking chocolate, lemon zest, fresh-cut fir in aroma and cup. Brisk acidity; lightly silky mouthfeel. The wood-framed finish is supported by notes of lemon zest and magnolia.", "notes": "Produced at Zuoyuan Farm in Yunnan, China, entirely of the Geisha variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Gee Coffee Roasters is a specialty roaster with 12 cafes in Guangzhou and Shenzhen, China. Visit the brand’s wechat official account, Gee Coffee Roasters, for more information.", "bottom line": "A friendly, accessible washed Geisha grown in China’s Yunnan Province — crisply chocolaty and floral with aromatic wood undertones.", "Roaster Location:": "Guangzhou, China", "Coffee Origin:": "Baoshan, Yunnan Province, China", "Roast Level:": "Medium-Light", "Agtron:": "57/74", "Est. Price:": "RMB 399/100 grams", "Review Date:": "July 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/biodynamic-washed-geisha/"}, {"rating": "93", "roaster": "Succulent Coffee Roasters", "title": "Guatemala La Colina", "blind assessment": "Bright, crisp, sweet-toned. Almond brittle, Pink Lady apple, baking chocolate, oak, marjoram in aroma and cup. Sweetly tart structure with brisk acidity; plush, viscous mouthfeel. Crisp, sweetly nutty finish.", "notes": "Produced by Anthony Medina of Finca La Colina, entirely of the Bourbon variety of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Imported by Primavera Coffee. Succulent Coffee Roasters is a Southern California specialty roaster and coffee shop founded in 2019. Visit www.succulentcoffeeroasters.com for more information.", "bottom line": "A straight-ahead, comfortable Guatemala cup with a throughline of sweet nut and crisp apple notes and an especially rich mouthfeel.", "Roaster Location:": "Huntington Beach, California", "Coffee Origin:": "San Martin Jilotepeque, Chimaltenango Department, Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "57/72", "Est. Price:": "$19.00/12 ounces", "Review Date:": "May 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/guatemala-la-colina/"}, {"rating": "93", "roaster": "Succulent Coffee Roasters", "title": "Burundi Bukeye", "blind assessment": "Balanced, floral, sweetly spice-toned. Magnolia, almond butter, ginger cookie, sugarcane, cedar in aroma and cup. Sweet-toned with brisk acidity; lightly satiny, very smooth mouthfeel. The crisp, richly sweet finish centers around sugarcane and almond.", "notes": "Produced by smallholding farmers of the Bukeye Commune, entirely of Bourbon-related varieties of Arabica, and processed by the traditional washed method (fruit skin and pulp removed before drying). Imported by Kafe Kreyol. Succulent Coffee Roasters is a Southern California specialty roaster and coffee shop founded in 2019. Visit www.succulentcoffeeroasters.com for more information", "bottom line": "An attractively complex, deeply layered, floral- and spice-toned Burundi.", "Roaster Location:": "Huntington Beach, California", "Coffee Origin:": "Bukeye Commune, Muramvya Province, Burundi", "Roast Level:": "Medium-Light", "Agtron:": "60/73", "Est. Price:": "$18.00/12 ounces", "Review Date:": "May 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/burundi-bukeye/"}, {"rating": "93", "roaster": "David's Nose", "title": "Costa Rica Aquiares Estate", "blind assessment": "Delicately fruit-toned, richly sweet-tart. Raspberry, magnolia, baking chocolate, honey, lemon verbena in aroma and cup. Sweet-tart structure with brisk acidity; viscous, syrupy-smooth mouthfeel. The quiet finish centers around raspberry and crisp chocolate notes.", "notes": "Produced at Aquíares Estate entirely of the Centroamericano variety of Arabica, and processed by the natural method (dried in the whole fruit). David's Nose is a specialty coffee roaster based in Taipei, Taiwan whose founder studied agronomy and has a deep interest in crop quality. For more information, visit www.dnose.com.tw .", "bottom line": "An accessibly complex natural-processed Costa Rica that leads with distinct berry notes with undertones of crisp chocolate and sweet herbs.", "Roaster Location:": "Taipei, Taiwan", "Coffee Origin:": "Aquíares, Cartago, Costa Rica", "Roast Level:": "Light", "Agtron:": "65/87", "Est. Price:": "NT $500/8 ounces", "Review Date:": "March 2023", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/costa-rica-aquiares-estate/"}, {"rating": "94", "roaster": "Press Coffee", "title": "Winter 2022 Allocation Colombia", "blind assessment": "Deeply aromatic, fruit-centered. Dried black cherry, cocoa nib, narcissus, thyme, a hint of wine barrel in aroma and cup. Brightly sweet structure with high-toned acidity; crisp, syrupy mouthfeel. The finish leads with notes of cocoa nib and narcissus.", "notes": "Produced by J ose Giraldo entirely of the Ethiopia-seed Wush Wush variety of Arabica, and processed by the washed carbonic maceration method, in which the coffee fruit is first pulped then fermented in CO2-infused tanks before drying. Based in Phoenix, Arizona, Press Coffee roasts in small batches to ensure the highest quality and consistency, while sharing their knowledge and passion for coffee with customers. Visit www.presscoffee.com for more information.", "bottom line": "A headily aromatic Colombia-grown Wush Wush processed by carbonic maceration, yielding a balanced, deeply fruity cup.", "Roaster Location:": "Phoenix, Arizona", "Coffee Origin:": "Quindio Department, Colombia", "Roast Level:": "Light", "Agtron:": "62/80", "Est. Price:": "$50.00/6 ounces", "Review Date:": "January 2023", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/winter-2022-allocation-colombia/"}, {"rating": "93", "roaster": "Cafe Red Bean Shop", "title": "Ecuador Finca Indera Geisha Honey", "blind assessment": "Brightly sweet, delicately spice-toned. Apricot, nutmeg, freesia-like flowers, hazelnut, baking chocolate in aroma and cup. Sweet-tart structure with lively acidity; crisp, lightly satiny mouthfeel. Apricot and hazelnut lead in the gentle finish.", "notes": "Produced by Manuel Alberto Romero Sánchez of Finca Indera entirely of the Geisha variety of Arabica, and processed by the honey method, in which skins are removed but some of the fruit flesh (“honey”) is allowed to adhere to the beans during drying. Cafe Red Bean Shop is a specialty coffee roaster based in Taipei, Taiwan. For more information, visit shopee.tw/caferedbean.", "bottom line": "A comfortable, spice-driven Ecuador Geisha cup with lovely floral and stone fruit notes throughout.", "Roaster Location:": "Taipei, Taiwan", "Coffee Origin:": "Chaguarpamba, Loja Province, Ecuador", "Roast Level:": "Medium-Light", "Agtron:": "60/74", "Est. Price:": "NT $950/227 grams", "Review Date:": "January 2023", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ecuador-finca-indera-geisha-honey/"}, {"rating": "93", "roaster": "El Gran Cafe", "title": "Finca El Potrero", "blind assessment": "High-toned, enticingly sweet. Black cherry, narcissus, cashew butter, lemon verbena, juniper bark in aroma and cup. Sweet-tart structure with bright acidity; crisp, satiny-smooth mouthfeel. The finish leads with notes of black cherry and lemon verbena, rounding to creamy cashew in the long.", "notes": "Produced by Josué Morales of Finca El Potrero from trees of the Sarchimor and Anacafé 14 varieties of Arabica, and processed by the traditional washed method ( fruit skin and flesh are removed from the beans before they are dried). El Gran Cafe is a coffee shop located in the heart of Antigua, Guatemala whose mission is to roast and serve organic-certified coffees produced at its own Finca La Esperanza and Finca El Pintado just outside of town. Featured in El Gran Cafe’s lineup are also coffees from friends and neighbors in the region, along with award-winning and exceptional coffees from other regions of Guatemala. Visit https://El Gran.cafe for more information.", "bottom line": "A bright, balanced, juicy Guatemala cup driven by dark stone fruit, spicy floral and sweet nut notes.", "Roaster Location:": "Antigua, Guatemala", "Coffee Origin:": "Antigua growing region, Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "60/76", "Est. Price:": "$10.00/12 ounces", "Review Date:": "November 2022", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/finca-el-potrero/"}, {"rating": "92", "roaster": "El Gran Cafe", "title": "Finca Patzibir", "blind assessment": "Crisply sweet, nut-toned. Almond brittle, pie cherry, magnolia, baking chocolate, mesquite in aroma and cup. Sweet structure with brisk acidity; very syrupy mouthfeel. The finish consolidates to notes of baking chocolate, pie cherry and mesquite.", "notes": "Produced by Andres Fahsen of Finca Patzibar entirely of the Catuai variety of Arabica, and processed by the traditional washed method ( fruit skin and flesh are removed from the beans before they are dried). Certified USDA Organic. El Gran Cafe is a coffee shop located in the heart of Antigua, Guatemala whose mission is to roast and serve organic-certified coffees produced at its own Finca La Esperanza and Finca El Pintado just outside of town. Featured in El Gran Cafe’s lineup are also coffees from friends and neighbors in the region, along with award-winning and exceptional coffees from other regions of Guatemala. Visit https://El Gran.cafe for more information.", "bottom line": "A quietly confident, sweetly nut-toned Guatemala cup with a particularly appealing, viscous mouthfeel.", "Roaster Location:": "Antigua, Guatemala", "Coffee Origin:": "Lake Atitlán growing region, Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "56/74", "Est. Price:": "$16.00/12 ounces", "Review Date:": "November 2022", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/finca-patzibir/"}, {"rating": "93", "roaster": "Branch Street Coffee Roasters", "title": "Colombia Huila Finca Villabetuila Anaerobic Honey", "blind assessment": "Deeply and richly sweet, chocolaty. Dried blueberry, chocolate fudge, gardenia, cedar, hazelnut in aroma and cup. Sweet-toned structure with round, fruity acidity; full, creamy mouthfeel.", "notes": "Produced at Finca Villabetuila and processed by the anaerobic honey method (beans, with skin removed, are fermented in a hermetically sealed container before drying). Branch Street Coffee Roasters is a small-batch specialty coffee roaster in Youngstown, Ohio. Visit www.branchstreetcoffee.com for more information.", "bottom line": "A berry-toned, richly chocolaty anaerobic honey cup from Colombia — almost dessert-like in its sweetness.", "Roaster Location:": "Youngstown, Ohio", "Coffee Origin:": "Huila Department, Colombia", "Roast Level:": "Medium-Light", "Agtron:": "59/74", "Est. Price:": "$19.95/12 ounces", "Review Date:": "July 2022", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/colombia-huila-finca-villabetuila-anaerobic-honey/"}, {"rating": "94", "roaster": "VERYTIME", "title": "Ethiopia Guji Shakiso G1 Honey", "blind assessment": "Fruit-toned, deeply floral. Raspberry, wisteria, honey, pink peppercorn, dark chocolate in aroma and cup. Sweetly tart structure with crisp, juicy acidity; full, satiny-smooth mouthfeel. The finish is driven by notes of raspberry and dark chocolate.", "notes": "Produced by smallholding farmers, from local heirloom varieties of Arabica, and processed by the honey method, in which the skins are removed from the fruit but some fruit flesh is allowed to dry on the beans. VERYTIME is a specialty nano-roaster based in Taoyuan, Taiwan. Visit www.verytime.com.tw/ for more information.", "bottom line": "A fruit and flower medley, this honey-processed Ethiopia cup is berry-toned with a richly floral throughline and supporting notes of dark chocolate.", "Roaster Location:": "Taoyuan, Taiwan", "Coffee Origin:": "Sidama growing region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "59/77", "Est. Price:": "NT $400/8 ounces", "Review Date:": "May 2022", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-guji-shakiso-g1-honey/"}, {"rating": "93", "roaster": "Dragonfly Coffee Roasters", "title": "Kenya Kamgogo Small Lot Reserve", "blind assessment": "Richly sweet-savory, subtly complex. Bing cherry, cocoa nib, Meyer lemon zest, fresh-cut fir, Nutella in aroma and cup. Balanced, sweetly savory structure with juicy-bright acidity; crisp, velvety mouthfeel. The finish consolidates to notes of crisp citrus and sweet Nutella notes.", "notes": "Produced by smallholding farmers surrounding the Karatina Coffee Factory from trees of the Ruiru 11, SL28 and Batian varieties of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Now based in Henderson, Nevada, Dragonfly Coffee was named 2019 Micro-Roaster of the Year by Roast magazine. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.", "bottom line": "A balanced, appealing Kenya cup: deep-toned, richly savory, and thoroughly chocolaty.", "Roaster Location:": "Henderson, Nevada", "Coffee Origin:": "Nyeri County, Kenya", "Roast Level:": "Medium-Light", "Agtron:": "58/67", "Est. Price:": "$20.00/12 ounces", "Review Date:": "May 2022", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kenya-kamgogo-small-lot-reserve/"}, {"rating": "93", "roaster": "Dragonfly Coffee Roasters", "title": "Rwanda Gatare Natural", "blind assessment": "Balanced, crisply fruit-toned. Black cherry, orange zest, almond, agave syrup, hint of lilac in aroma and cup. Sweet-toned structure with gentle acidity; full, syrupy mouthfeel. Delicately fruit-toned finish with undertones of almond.", "notes": "Produced by smallholding farmers, entirely of the Red Bourbon variety of Arabica, and processed by the natural method (dried in the whole fruit). Now based in Henderson, Nevada, Dragonfly Coffee was named 2019 Micro-Roaster of the Year by Roast magazine. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.", "bottom line": "A pretty natural-processed Rwanda cup, fruit-forward and nutty with floral undertones.", "Roaster Location:": "Henderson, Nevada", "Coffee Origin:": "Western Province, Rwanda", "Roast Level:": "Medium-Light", "Agtron:": "58/76", "Est. Price:": "$18.00/12 ounces", "Review Date:": "May 2022", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/rwanda-gatare-natural/"}, {"rating": "93", "roaster": "VERYTIME", "title": "Ethiopia Yirgacheffe Adorsi G1", "blind assessment": "Deeply sweet, intense, perfumy. Guava, ripe banana, chocolate fudge, oak, lily in aroma and cup. Juicy-sweet and lactic (yogurty) in structure with pleasingly tart acidity; syrupy-smooth mouthfeel. Crisply sweet finish consolidates to notes of chocolate fudge, lily and oak.", "notes": "Produced by Aricha Adorsi from trees of indigenous landrace varieties of Arabica long grown in the Yirgacheffe region, and processed by the anaerobic natural method (fermented in the whole fruit in a hermetically sealed vessel). VERYTIME is a specialty nano-roaster based in Taoyuan, Taiwan. Visit www.verytime.com.tw/ for more information.", "bottom line": "A chocolaty, fruit-forward cup with undertones of rich florals and deep aromatic wood.", "Roaster Location:": "Taoyuan, Taiwan", "Coffee Origin:": "Yirgacheffe growing region, south-central Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "58/76", "Est. Price:": "NT $450/8 ounces", "Review Date:": "February 2022", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-adorsi-g1/"}, {"rating": "93", "roaster": "VERYTIME", "title": "COE Sidama Bona 74110", "blind assessment": "Sweetly fruit-forward, deeply aromatic. Passion fruit, tangerine zest, cocoa nib, lemon verbena, agave syrup in aroma and cup. Sweet-tart structure with vibrant acidity; satiny-smooth mouthfeel. The finish centers around notes of tangerine with cocoa undertones.", "notes": "Produced by Ayele Tulu entirely of the 74110 variety of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). VERYTIME is a specialty nano-roaster based in Taoyuan, Taiwan. Visit www.verytime.com.tw/ for more information.", "bottom line": "A nuanced, balanced washed Ethiopia cup with deep tropical fruit, cocoa, and spicy floral notes.", "Roaster Location:": "Taoyuan, Taiwan", "Coffee Origin:": "Sidamo (also Sidama) growing region, south-central Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "58/76", "Est. Price:": "NT $450/8 ounces", "Review Date:": "February 2022", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/coe-sidama-bona-74110/"}, {"rating": "91", "roaster": "VERYTIME", "title": "Ethiopia Yirgacheffe G1", "blind assessment": "A friendly, accessible natural-processed Ethiopia cup: crisply sweet, deeply chocolaty, with hints of spicy florals throughout.", "notes": "Produced by smallholding farmers in the Wete Rural Village from trees of indigenous landrace varieties of Arabica long grown in the Yirgacheffe region, and processed by the natural method (dried in the whole fruit). VERYTIME is a specialty nano-roaster based in Taoyuan, Taiwan. Visit www.verytime.com.tw/ for more information.", "bottom line": "A friendly, accessible natural-processed Ethiopia cup: crisply sweet, deeply chocolaty, with hints of spicy florals throughout.", "Roaster Location:": "Taoyuan, Taiwan", "Coffee Origin:": "Yirgacheffe growing region, south-central Ethiopia", "Roast Level:": "Light", "Agtron:": "62/84", "Est. Price:": "NT $300/8 ounces", "Review Date:": "February 2022", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-g1-2/"}, {"rating": "95", "roaster": "Bird Rock Coffee Roasters", "title": "El Socorro Maracaturra", "blind assessment": "Deep-toned, complex. Bing cherry, cocoa nib, butterscotch, rhododendron, cedar in aroma and cup. Sweet-tart structure with juicy, bright acidity; very smooth, syrupy mouthfeel. Resonant, nuanced, long finish.", "notes": "Produced by Juan Diego of Finca El Socorro entirely of the big-beaned Maracaturra variety of Arabica, and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried). Bird Rock Coffee Roasters is a retailer and wholesaler focused on organic and socially responsible coffees; it was awarded the “2012 Micro-Roaster of the Year” title by Roast Magazine. Visit www.birdrockcoffee.com or call 858-551-1707 for more information.", "bottom line": "A plush, richly sweet, multi-layered Guatemala Maracaturra offering both depth and levity.", "Roaster Location:": "San Diego, California", "Coffee Origin:": "Palencia, Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "60/74", "Est. Price:": "$26.00/12 ounces", "Review Date:": "December 2021", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/el-socorro-maracaturra-2/"}, {"rating": "94", "roaster": "VERYTIME", "title": "Ethiopia Bench Maji Natural Gesha", "blind assessment": "Rich, intensely sweet, floral-toned. Lilac, tangerine, cocoa nib, apricot, myrrh in aroma and cup. Lively, sweet-tart structure with bright acidity; plush, syrupy-smooth mouthfeel. The resonant finish centers around juicy citrus and lilac tones, grounded by cocoa nib.", "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also Geisha) by Adam and Rachel Overton. Although the Gesha variety originated in Ethiopia, it was “discovered” by the coffee world in 2004 growing in Boquete, Panama, and Panama continues to dominate the expanding world of Gesha. This particular version, however, is the outcome of efforts to commercialize Gesha in the region from which it originally came. Processed by the natural method (dried in the whole fruit). VERYTIME is a specialty nano-roaster based in Taoyuan, Taiwan. Visit www.verytime.com.tw/ for more information.", "bottom line": "A complex, multi-layered natural-processed Gesha from Ethiopia: juicy, floral, cocoa-toned, balanced.", "Roaster Location:": "Taoyuan, Taiwan", "Coffee Origin:": "Bench-Maji Zone, Southern Ethiopia", "Roast Level:": "Light", "Agtron:": "62/80", "Est. Price:": "NT $550/8 ounces", "Review Date:": "December 2021", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-bench-maji-natural-gesha/"}, {"rating": "94", "roaster": "Coffee Cycle", "title": "Kenya Kainamui AB", "blind assessment": "Juicy, bright, deeply sweet-savory. Candied violet, black cherry, honey, almond butter, cedar in aroma and cup. Richly sweet structure with bright, phosphoric acidity; satiny-full mouthfeel. Juicy in the short finish with notes of honey and black cherry in the long.", "notes": "Despite challenges ranging from contested government coffee policy and urban encroachment on prime coffee lands to chronically unstable weather, Kenya continues to produce some of the world’s most elegant and distinctive coffees. What began as a bike-powered mobile coffee shop born out of founder Chris O’Brien’s love of cycling now has a permanent home in San Diego, where he roasts and serves coffee to guests. Visit www.coffeecycleroasting.com for more information.", "bottom line": "A deep-toned, multi-layered Kenya cup with notes of tart fruit, rich nut tones, and sweet florals throughout.", "Roaster Location:": "San Diego, California", "Coffee Origin:": "Kirinyaga County, Kenya", "Roast Level:": "Medium-Light", "Agtron:": "58/76", "Est. Price:": "$16.50/250 grams", "Review Date:": "November 2021", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kenya-kainamui-ab/"}, {"rating": "93", "roaster": "Cafe Kreyol", "title": "Ethiopian Sweet Lily", "blind assessment": "Richly sweet, floral-toned. Magnolia, almond, maple syrup, plum, myrrh in aroma and cup. Sweetly tart structure, with bright, juicy acidity; delicate, silky mouthfeel. The richly drying finish centers around notes of almond and myrrh.", "notes": "Produced by smallholding farmers around the Biru Bekele washing station, largely produced from distinctive indigenous Ethiopian landrace varieties of Arabica long grown in the region. Processed by the natural method (dried in the whole fruit). Cafe Kreyol is a roaster in Manassas, Virginia with the mission of creating sustainable employment by way of specialty coffee. Visit www.cafekreyol.com or call 571-719-7018 for more information.", "bottom line": "A deeply sweet natural-processed Ethiopia coffee with magnolia-like floral notes and an undercurrent of stone fruit and myrrh.", "Roaster Location:": "Manassas, Virginia", "Coffee Origin:": "Guji Zone, Oromia Region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "56/72", "Est. Price:": "$15.99/12 ounces", "Review Date:": "November 2021", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopian-sweet-lily/"}, {"rating": "92", "roaster": "Coffee Cycle", "title": "Ethiopia Nano Genji #10", "blind assessment": "Vibrant, richly chocolaty. Baking chocolate, orange grapefruit zest, apricot, almond, lemon-thyme in aroma and cup. Sweet-tart structure with brisk acidity; full, velvety mouthfeel. Citrusy, chocolate-toned finish with undertones of sweet herbs.", "notes": "Produced from indigenous Ethiopian landrace tree varieties long grown in the region and processed by the washed method (fruit skin and pulp are removed before drying). What began as a bike-powered mobile coffee shop born out of founder Chris O’Brien’s love of cycling now has a permanent home in San Diego, where he roasts and serves coffee to guests. Visit www.coffeecycleroasting.com for more information.", "bottom line": "A chocolaty, citrusy, sweetly herbaceous washed Ethiopia cup.", "Roaster Location:": "San Diego, California", "Coffee Origin:": "Guji Zone, Oromia Region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "58/80", "Est. Price:": "$16.00/250 grams", "Review Date:": "November 2021", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-nano-genji-10/"}, {"rating": "91", "roaster": "Cafe Kreyol", "title": "Organic 18 Rabbits Honduras", "blind assessment": "Quietly nuanced, nut-forward. Hazelnut, caramel, grapefruit, fresh-cut fir, a hint of gardenia in aroma and cup. Sweetly brisk structure; velvety mouthfeel. The nut-toned finish is supported by caramel and spice-toned florals.", "notes": "18 Rabbits (18 Conejos) is a collective of farms all owned by different members of the Zelaya Ontreras family. Dulce Marlen, the owner of Finca Dulce Luna, is the matriarch of the family and the owner of 18 Rabbit exports. Cafe Kreyol is a roaster in Manassas, Virginia with the mission of creating sustainable employment by way of specialty coffee. Visit www.cafekreyol.com or call 571-719-7018 for more information.", "bottom line": "A sweet, delicately nut-toned honey-processed Honduras cup.", "Roaster Location:": "Manassas, Virginia", "Coffee Origin:": "Marcala, Honduras", "Roast Level:": "Medium-Light", "Agtron:": "58/74", "Est. Price:": "$12.99/12 ounces", "Review Date:": "November 2021", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/organic-18-rabbits-honduras/"}, {"rating": "90", "roaster": "Cafe Kreyol", "title": "Bolivia Apolo Latin America Microlot", "blind assessment": "Deep-toned, crisply chocolaty. Baking chocolate, cashew, orange zest, cedar, date in aroma and cup. Sweet structure with gentle acidity; full, creamy mouthfeel. The lightly drying finish leads with notes of baking chocolate and cedar.", "notes": "Produced by smallholding farmers of the Mulihuari community, and processed by the washed method. Cafe Kreyol is a roaster in Manassas, Virginia with the mission of creating sustainable employment by way of specialty coffee. Visit www.cafekreyol.com or call 571-719-7018 for more information.", "bottom line": "A crisp, richly full-bodied Bolivia cup with soft acidity and pleasing chocolate notes throughout.", "Roaster Location:": "Manassas, Virginia", "Coffee Origin:": "Bolivia", "Roast Level:": "Medium-Light", "Agtron:": "50/77", "Est. Price:": "$15.99/12 ounces", "Review Date:": "November 2021", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "8", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/bolivia-apolo-latin-america-microlot/"}, {"rating": "92", "roaster": "Le Brewlife", "title": "Brazil COE", "blind assessment": "Gently fruit-toned, sweetly earthy. Golden raisin, hazelnut, freesia-like flowers, cedar, fresh leather in aroma and cup. Sweet-savory with round, fruity acidity; crisp, velvety mouthfeel. Finish consolidates to notes of golden raisin and fresh leather.", "notes": "Produced at Fazenda Rainha entirely of the Yellow Bourbon variety of Arabica and processed by the natural method (beans are dried in the whole fruit). Le Brewlife is a specialty coffee roaster based in Taichung, Taiwan. Visit www.lebrewlife.co for more information.", "bottom line": "A friendly Brazil cup with leading notes of dried fruit and undertones of spicy florals and fresh leather.", "Roaster Location:": "Taichung, Taiwan", "Coffee Origin:": "Vale da Grama, Minas Gerais State, Brazil", "Roast Level:": "Medium-Light", "Agtron:": "58/74", "Est. Price:": "NT $570/250 grams", "Review Date:": "September 2021", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/brazil-coe/"}, {"rating": "90", "roaster": "Le Brewlife", "title": "Alishan Taiwan", "blind assessment": "Crisply cocoa-toned. Baking chocolate, magnolia, pie cherry, oak, cane sugar in aroma and cup. Sweet structure with brisk acidity; crisp, silky mouthfeel. Cocoa-driven finish with undertones of oak and cane sugar.", "notes": "Produced at Zhou Zhu Yuan farm entirely of the So’ngna variety of Arabica and processed by the washed method (fruit skin and flesh are removed from the beans before they are dried) . Le Brewlife is a specialty coffee roaster based in Taichung, Taiwan. Visit www.lebrewlife.co for more information.", "bottom line": "An accessible, crisply sweet Taiwan cup with subtle depth.", "Roaster Location:": "Taichung, Taiwan", "Coffee Origin:": "Alishan, Taiwan", "Roast Level:": "Medium-Light", "Agtron:": "56/72", "Est. Price:": "NT $1580/250 grams", "Review Date:": "September 2021", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/alishan-taiwan/"}, {"rating": "94", "roaster": "Plat Coffee Roastery", "title": "Colombia Diofanor Ruiz", "blind assessment": "Crisply sweet-tart, fruit-toned. Vanilla yogurt, Ibarra chocolate (chocolate with cinnamon), gardenia, amber, date in aroma and cup. Rich, sweetly tart structure with bright, tangy acidity; syrupy-smooth mouthfeel. Resonant, flavor-laden, long finish.", "notes": "Produced by Diofanor Ruiz of Buenavista Farm entirely of the Castillo variety of Arabica and processed by the natural method (dried in the whole fruit) . Plat Coffee is a specialty roaster and café in Hong Kong. For more information, visit www.platcoffee.com.", "bottom line": "A uniquely composed natural-processed coffee with unusual yogurt-like nuance layered with chocolate, fruit and floral suggestions.", "Roaster Location:": "Hong Kong, China", "Coffee Origin:": "Quindío Department, Colombia", "Roast Level:": "Medium-Light", "Agtron:": "58/76", "Est. Price:": "$25.00/6 ounces", "Review Date:": "February 2021", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/colombia-diofanor-ruiz/"}, {"rating": "93", "roaster": "Wonderstate Coffee", "title": "Peru El Corazon Gesha", "blind assessment": "Rich, deep, chocolaty. Dark chocolate, hazelnut, plum, maple syrup, cedar in aroma and cup. Sweet structure with brisk acidity; velvety-smooth mouthfeel. Chocolaty finish with undertones of almond and fresh-cut cedar.", "notes": "Produced by Efrain Carhuallocllo and Maria Arevalo Vasquez entirely of the celebrated Gesha (also spelled Geisha) variety of Arabica and processed by the washed method (fruit skin and pulp are removed before drying). Wonderstate Coffee, formerly Kickapoo Coffee, is an award-winning roaster based in rural Wisconsin known for its commitment to guaranteeing higher pay for farmers and being the country’s first 100% solar-powered roastery. Visit wonderstate.com for more information.", "bottom line": "Simultaneously deep and high-toned, saturated with notes of stone fruit, dark chocolate, sweet nuts, and rich aromatic wood — a persuasive presentation of the admired and still-rare Gesha variety.", "Roaster Location:": "Viroqua, Wisconsin", "Coffee Origin:": "Chirinos, Cajamarca Region, Peru", "Roast Level:": "Medium-Light", "Agtron:": "59/77", "Est. Price:": "$20.00/6 ounces", "Review Date:": "January 2021", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/peru-el-corazon-gesha/"}, {"rating": "93", "roaster": "Plat Coffee Roastery", "title": "Playground SOE Espresso", "blind assessment": "Evaluated as espresso. Richly sweet-tart. Pomegranate, dark chocolate, narcissus, hazelnut, cedar in aroma and small cup. Satiny-smooth mouthfeel; fruit-driven, chocolaty finish. In three parts milk the fruit rounds and softens and chocolate notes are foregrounded.", "notes": "Produced at Fazenda Recreio and comprised entirely of the Yellow Bourbon variety of Arabica processed by the natural method. Plat Coffee is a specialty roaster and café in Hong Kong. For more information, visit www.platcoffee.com.", "bottom line": "An inviting single-origin (and single-variety) espresso from Brazil characterized by pomegranate-like fruit and deep chocolate.", "Roaster Location:": "Hong Kong, China", "Coffee Origin:": "São Sebastião da Grama, Sul de Minas, Brazil", "Roast Level:": "Medium-Light", "Agtron:": "54/70", "Est. Price:": "$60.00/30 ounces", "Review Date:": "September 2020", "Aroma:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "With Milk:": "9", "url": "https://www.coffeereview.com/review/playground-soe-espresso/"}, {"rating": "95", "roaster": "GK Coffee", "title": "Kenya Embu Gicherori Factory AA Top", "blind assessment": "Sweetly and roundly bright, high-toned, floral. Star jasmine, tangerine zest, red currant, elm, a hint of coriander in aroma and cup. Sweetly tart structure with vibrant, juicy acidity; crisp yet buoyant, syrupy mouthfeel. The richly flavor-saturated finish carries all the notes of the cup straight through into the long, particularly jasmine and red currant.", "notes": "Produced by the Kibugu Farmer Cooperative Society(FCS) from trees of the celebrated SL28 and SL34 varieties of Arabica. GK Coffee provides quality specialty coffee to consumers and retailers. For more information, visit www.gkcoffee.com.tw or email [email protected] .", "bottom line": "A gorgeous rendition of the classic Kenya cup: juicy, sweetly bright, lushly floral- and fruit-toned.", "Roaster Location:": "Yilan, Taiwan", "Coffee Origin:": "Embu County, Kenya", "Roast Level:": "Medium-Light", "Agtron:": "58/74", "Est. Price:": "NT $580/200 grams", "Review Date:": "June 2020", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/kenya-embu-gicherori-factory-aa-top/"}, {"rating": "93", "roaster": "Klatch Coffee", "title": "El Salvador Las Mercedes Pacamara Honey", "blind assessment": "Richly sweet-savory. Pomegranate, fine musk, nougat, cedar, a hint of marjoram in aroma and cup. Savory-sweet structure with round, gentle acidity; full, satiny-smooth mouthfeel. Finish consolidates to nougat and pomegranate in the short with musk returning in the long.", "notes": "Produced by Lucia Abregado De Ortiz of Finca Las Mercedes entirely of the admired, big-beaned Pacamara variety of Arabica and processed by the honey method. With all honey processing methods, some sweet pulp or fruit flesh (“honey”) is allowed to adhere to the beans during drying. Klatch Coffee is an award-winning small-batch roasting company in the Los Angeles area whose resident barista and trainer, Heather Perry, won both the 2003 and 2007 United States Barista Championships brewing a Klatch Coffee espresso blend. Visit www.klatchroasting.com or call 877-455-2824 for more information.", "bottom line": "A deeply sweet Pacamara cup with savory undertones throughout, reminiscent of fine musk and marjoram-like sweet herbs.", "Roaster Location:": "Los Angeles", "Coffee Origin:": "Cerro El Tigre, El Salvador", "Roast Level:": "Light", "Agtron:": "60/82", "Est. Price:": "$16.95/12 ounces", "Review Date:": "December 2019", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/el-salvador-las-mercedes-pacamara-honey-2/"}, {"rating": "90", "roaster": "Klatch Coffee", "title": "Guatemala Concepción Buena Vista", "blind assessment": "Delicate, sweet-toned. Apricot, fresh-cut fir, magnolia, hazelnut, cocoa powder in aroma and cup. Sweet in structure with lively acidity; velvety mouthfeel. The finish is richly drying with notes of hazelnut, fir and cocoa powder.", "notes": "Produced by Bernardo Solano of Concepcion Farm and processed by the wet or washed method, in which skin and fruit flesh are removed from the beans or seeds before they are dried . Klatch Coffee is an award-winning small-batch roasting company in the Los Angeles area whose resident barista and trainer, Heather Perry, won both the 2003 and 2007 United States Barista Championships brewing a Klatch Coffee espresso blend. Visit www.klatchroasting.com or call 877-455-2824 for more information.", "bottom line": "A friendly, accessible Central America cup, crisply sweet with notes of stone fruit, cocoa and hazelnut.", "Roaster Location:": "Los Angeles, California", "Coffee Origin:": "Chimaltenango, Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "59/77", "Est. Price:": "$16.95/12 ounces", "Review Date:": "December 2019", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/guatemala-concepcion-buena-vista/"}, {"rating": "95", "roaster": "Dragonfly Coffee Roasters", "title": "Panama Hacienda La Esmeralda Super Mario 6 Geisha", "blind assessment": "Impeccably floral and cocoa-toned with a savory throughline. Chocolate fudge, wisteria, Asian pear, hazelnut butter, white peppercorn in aroma and cup. Richly sweet-savory structure with floral acidity; velvety-smooth, viscous mouthfeel. The finish centers around spice-toned chocolate (think dark chocolate with peppercorns) and wisteria.", "notes": "This coffee earned the third-highest rating in a cupping of coffees of the Geisha/Gesha variety of Arabica for Coffee Review’s September 2019 tasting report. Coffee from trees of the botanical variety Geisha (also Gesha) grown on Hacienda La Esmeralda in Panama first introduced this extraordinary variety of Arabica to the world. With its bold, boat-shaped beans and distinctive floral and crisply cocoa-toned cup, the Geisha/Gesha continues to be one of the world’s most celebrated and sought-after coffee varieties, and the Esmeralda versions remain among the most authentic. This is a wet-processed or “washed” version, meaning the fruit skin and pulp were removed from the beans immediately after harvesting but before drying. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.", "bottom line": "Extravagant florals and spice-toned cocoa notes characterize this deeply sweet, washed-processed Panama cup with a nuanced yet omnipresent umami impulse.", "Roaster Location:": "Boulder, Colorado", "Coffee Origin:": "Boquete growing region, western Panama", "Roast Level:": "Medium-Light", "Agtron:": "51/71", "Est. Price:": "$60.00/8 ounces", "Review Date:": "September 2019", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/panama-hacienda-la-esmeralda-super-mario-6-geisha/"}, {"rating": "93", "roaster": "Coava Coffee Roasters", "title": "Santa Luzia Brazil", "blind assessment": "Delicate, fruit-toned. Dried strawberry, brandy, dark chocolate, cedar, pink peppercorn in aroma and cup. Sweet-toned in structure with gentle, round acidity; lightly syrupy mouthfeel. Sweetly fermenty in the finish with notes of berry liqueur and pink peppercorn.", "notes": "Produced by Jose Oliveira entirely of the Catuai variety of Arabica, and processed by the pulped natural method, meaning that the outer skin of the coffee fruit is removed as it is in the wet or “washed” process, but all or some of the sticky fruit residue is allowed to dry on the bean and later removed by machine along with the parchment skin. Coava is a Portland-based coffee roaster, now with a San Diego location as well, that aims to provide quality coffee and education regarding the preparation of good coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": "A quiet, integrated fruit-forward coffee from Brazil, with leading notes of brandy-toned strawberry and chocolate.", "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Cerrado Mineiro growing region, Santa Luzia, Brazil", "Roast Level:": "Medium-Light", "Agtron:": "54/78", "Est. Price:": "$15.00/250 grams", "Review Date:": "January 2019", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/santa-luzia-brazil/"}, {"rating": "93", "roaster": "Coava Coffee Roasters", "title": "Porfirio Castellanos Honduras", "blind assessment": "Crisply sweet-savory. Toffee, black cherry, rosewood, walnut, violet-like flowers in aroma and cup. Richly bittersweet structure with juicy acidity; satiny-smooth mouthfeel. The crisp finish consolidates to notes of black cherry and walnut.", "notes": "Produced by Porfirio Castellanos entirely of the Pacas variety of Arabica. This is a wet-processed or washed coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Coava is a Portland-based coffee roaster, now with a San Diego location as well, that aims to provide quality coffee and education regarding the preparation of good coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": "A rich, savory-leaning Pacas cup with tremendous depth of aroma and flavor.", "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Santa Bárbara, Honduras", "Roast Level:": "Medium-Light", "Agtron:": "56/80", "Est. Price:": "$15.00/250 grams", "Review Date:": "January 2019", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/porfirio-castellanos-honduras/"}, {"rating": "94", "roaster": "Magnolia Coffee", "title": "Costa Rica Cumbres Del Poas “Perla Negra” Natural", "blind assessment": "Evaluated as espresso. Bright, richly sweet, fruit- and cocoa-toned. Pomegranate, dark chocolate, narcissus, hazelnut, vanilla in aroma and small cup. Plush, creamy mouthfeel; sweetly tart finish with notes of pomegranate and hazelnut. Resonant and flavor-saturated in three parts milk; chocolate and tart fruit lead, with narcissus-like flowers ringing into the long finish.", "notes": "This exceptional coffee was selected as the No. 27 coffee on Coffee Review’s list of the Top 30 Coffees of 2018. This coffee tied for the second-highest rating in a tasting of natural-processed single-origin espressos for Coffee Review’s August 2018 tasting report. Produced by Oscar and Francisca Chacon entirely from trees of the Caturra variety of Arabica; certified organically grown. Processed by “natural” or dry method, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft Roasted. Truly Delicious. Socially Conscious.” Magnolia Coffee focuses on direct-trade coffees that make a difference in the lives of the coffee harvesters and their communities. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": "A brightly expressed fruit and chocolate bomb with ballast from notes of rich nut and sweet flowers.", "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Sabanilla de Alajuela growing region, Costa Rica", "Roast Level:": "Medium-Light", "Agtron:": "59/79", "Est. Price:": "$18.00/12 ounces", "Review Date:": "August 2018", "Aroma:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "With Milk:": "9", "url": "https://www.coffeereview.com/review/costa-rica-cumbres-del-poas-perla-negra-natural/"}, {"rating": "92", "roaster": "Espresso Republic", "title": "Static Peru Valle de Chingama Peru", "blind assessment": "Deeply pungent and richly sweet. Lavender, baker’s chocolate, oak, ripe fig, a hint of ginger in aroma and cup. Roundly sweet-tart and juicy in structure; full and satiny in mouthfeel. Baker’s chocolate carries distinctly and pleasingly into an otherwise short finish.", "notes": "Produced by small-holding farmers in northern Peru from trees of the Bourbon, Caturra and Typica varieties of Arabica. Processed by the wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.", "bottom line": "A fine Peru, with the round, pungently chocolaty character of the type supported by crisp floral top notes and a plump, smooth mouthfeel.", "Roaster Location:": "Chino, California", "Coffee Origin:": "Cajamarca region, northern Peru", "Roast Level:": "Medium-Light", "Agtron:": "57/78", "Est. Price:": "$13.95/12 ounces", "Review Date:": "August 2018", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/static-peru-valle-de-chingama-peru/"}, {"rating": "90", "roaster": "Espresso Republic", "title": "Static Chirinos Peru", "blind assessment": "Richly low-toned, gently zesty. Cedar, baker’s chocolate, grapefruit zest, apple, a hint of magnolia-like flowers in aroma and cup. Sweetly and quietly tart in structure, with a brisk edge. Plump mouthfeel. Flavor consolidates in a sweet, though rather drying, finish.", "notes": "Produced by some of the over 700 small-holding farmers of the La Prosperidad de Chirinos cooperative in northern Peru from trees of the Bourbon and Caturra varieties of Arabica. Processed by the wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.", "bottom line": "A quietly rich Peru, sweet yet briskly zesty.", "Roaster Location:": "Chino, California", "Coffee Origin:": "Cajamarca region, northern Peru", "Roast Level:": "Medium-Light", "Agtron:": "58/80", "Est. Price:": "$13.95/12 ounces", "Review Date:": "August 2018", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/static-chirinos-peru/"}, {"rating": "94", "roaster": "Dragonfly Coffee Roasters", "title": "DR Congo FTO Bourbon SOPACDI", "blind assessment": "Richly savory, deeply sweet. Ginger blossom, almond brittle, pear, fresh, moist forest notes, wildflower honey in aroma and cup. Structured balance among sweet, tart and savory tastes; crisp, velvety mouthfeel. The honey-toned finish leads with ginger blossom in the short and notes of pear and almond in the long.", "notes": "This exceptional coffee was selected as the No. 11 coffee on Coffee Review’s list of the Top 30 Coffees of 2018. This coffee earned the second-highest rating in a cupping of coffees from the Great Lakes region of Africa for Coffee Review’s June 2018 tasting report. Produced entirely from trees of the Bourbon variety of Arabica by members of the SOPACDI coop. Located overlooking Lake Kivu, on the opposite side of the lake from Rwanda, this rapidly growing cooperative now has 5,600 members and apparently is succeeding in its goal to help heal wounds left by the latest in eastern Congo’s seemingly endless string of horrific rebellions and civil wars. A wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. This coffee is certified organically grown and certified fair trade, meaning it was purchased at no less than a minimum price determined by the certifying agency to be economically sustainable for the farmers. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.", "bottom line": "One of the finest Congos we've cupped in years: spice-toned, floral, tantalizingly sweet-savory, with a throughline of rich earth tones evoking a forest walk after a rain.", "Roaster Location:": "Boulder, Colorado", "Coffee Origin:": "Kalehe, South Kivu Province, Democratic Republic of the Congo", "Roast Level:": "Medium-Light", "Agtron:": "50/74", "Est. Price:": "$18.00/12 ounces", "Review Date:": "June 2018", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/dr-congo-fto-bourbon-sopacdi/"}, {"rating": "90", "roaster": "Oceana Coffee", "title": "Uganda Kapchorwa", "blind assessment": "Crisply sweet, spice-toned. Brown sugar, baked apple, lemon zest, cayenne, fresh-cut pine in aroma and cup. Bittersweet structure; delicate, satiny mouthfeel. The richly drying finish is characterized by notes of baked apple in the short and bittersweet citrus zest with a hint of warming spice in the long.", "notes": "This coffee tied for the fifth-highest rating in a cupping of coffees from the Great Lakes region of Africa for Coffee Review’s June 2018 tasting report. Produced from the SL14, SL28 and Bugisu local varieties of Arabica and processed at the Kayagalanyi Kapchorwa Washing station in eastern Uganda near Mount Elgon. Established in 2009 by Amy and Scott Angelo, Oceana brews specialty coffees that have been roasted in small batches at its roasting house and café in Tequesta, Florida. Oceana reports that its staff is obsessed with every detail of the process, from sourcing the beans to how the coffee is poured, aimed at ensuring that every cup is as rich and resonant as it should be. Visit www.oceanacoffee.com for more information.", "bottom line": "A pleasingly bittersweet, spice-toned coffee from Uganda.", "Roaster Location:": "Tequesta, Florida", "Coffee Origin:": "Kapchorwa District, Eastern Region, Uganda", "Roast Level:": "Medium-Light", "Agtron:": "52/78", "Est. Price:": "$18.00/12 ounces", "Review Date:": "June 2018", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/uganda/"}, {"rating": "95", "roaster": "Dragonfly Coffee Roasters", "title": "Lycello by Ninety Plus", "blind assessment": "Sweetly spice-toned, deeply rich. Bergamot, almond, fresh parsley, gardenia, oak in aroma and cup. Crisply sweet, softly tart in structure; plush, full mouthfeel. The rich, resonant finish carries over all the notes from the cup, a nut-toned bergamot in particular.", "notes": "Produced from trees of the rare Ethiopia-derived botanical variety, Gesha. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world’s most unique coffees. This is a wet-processed or “washed” version, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. It was produced by boutique exporter/importer Ninety Plus Coffee. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.", "bottom line": "Complete: suave, flavor-saturated, big-bodied, sweetly and gracefully bright.", "Roaster Location:": "Boulder, Colorado", "Coffee Origin:": "Chiriqui Province, far western Panama", "Roast Level:": "Medium-Light", "Agtron:": "54/78", "Est. Price:": "$75.00/8 ounces", "Review Date:": "April 2018", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/lycello-ninety-plus/"}, {"rating": "96", "roaster": "Dragonfly Coffee Roasters", "title": "Yemen Microlot", "blind assessment": "Delicate, high-toned, richly sweet. Caramelized apple, honeysuckle, baker’s chocolate, tangerine zest, frankincense in aroma and cup. Balanced structure with bright, juicy acidity; buoyant, syrupy mouthfeel. The deeply sweet, flavor-laden finish leads with notes of cacao nib and honeysuckle in the short and rich frankincense with hints of bittersweet citrus zest in the long.", "notes": "This exceptional coffee was selected as the No. 7 coffee on Coffee Review’s list of the Top 30 Coffees of 2018. Although Ethiopia is the botanical home of Coffea Arabica, Yemen introduced the beverage to the rest of the world in the 16th and 17th centuries, and Yemen coffee is still grown from ancient heirloom cultivars of arabica on stone-walled terraces ringing fortress-like mountaintop villages. All Yemen coffees are natural-processed, or dried in the whole fruit. This is a particularly refined, elegant example of the this ancient style. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.", "bottom line": "A stunningly balanced, bright, flavor-saturated Yemen cup characterized by rich fruit and cocoa-toned floral notes throughout.", "Roaster Location:": "Boulder, Colorado", "Coffee Origin:": "Yemen", "Roast Level:": "Light", "Agtron:": "58/84", "Est. Price:": "$75.00/8 ounces", "Review Date:": "April 2018", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/yemen-microlot/"}, {"rating": "94", "roaster": "Hula Daddy Kona Coffee", "title": "Karen J Red Bourbon", "blind assessment": "Rich-toned, subtly complex. Pineapple, sandalwood, jasmine, honey, cocoa in aroma and cup. Deeply sweet in structure with juicy acidity; plush, syrupy mouthfeel. The resonant finish leads with cocoa-toned pineapple in the short, rounding to jasmine in the long.", "notes": "Produced entirely from trees of the Red Bourbon variety of Arabica and grown on Hula Daddy’s higher farm at 2,500 feet. This presentation is named for co-owner Karen Paterson, whose middle name is Jue and whose favorite coffee is the Red Bourbon. This coffee tied for the second-highest rating in a cupping of coffees roasted by women for Coffee Review ‘s April 2018 tasting report. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "A complexly nuanced Kona-grown Red Bourbon, rife with sweet fruit and floral notes supported by undertones of rich sandalwood.", "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "58/80", "Est. Price:": "$45.95/8 ounces", "Review Date:": "April 2018", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/karen-j-red-bourbon/"}, {"rating": "95", "roaster": "Dragonfly Coffee Roasters", "title": "Lotus by Ninety Plus", "blind assessment": "Wildly, disconcertingly original. Sweetly tart, simultaneously fruit- and earth-toned, bright yet lush. Fresh clover, earth, fresh-pressed red grape juice, dark chocolate, white peppercorn in aroma and cup. Juicy sweet yet zesty and savory in structure. Full, syrupy mouthfeel. The finish is resonant and intensely flavor-saturated.", "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Gesha. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world’s most unique coffees. This is a particularly refined dried-in-the-fruit or natural presentation of the Gesha variety developed by boutique exporter/importer Ninety Plus Coffee. Dragonfly Coffee is a Boulder, Colorado-based micro-roaster that produces high-quality coffees and supports worthy causes. Visit www.dragonflycoffeeroasters.com or call 303-579-2154 for more information.", "bottom line": "For well-heeled coffee adventurers, a coffee so original it is difficult to categorize. It provokes a tremendous range of sensory association that situates it on the frontier of coffee expression, hovering somewhere between disturbing and extraordinary.", "Roaster Location:": "Boulder, Colorado", "Coffee Origin:": "Chiriqui Province, far western Panama", "Roast Level:": "Medium-Light", "Agtron:": "52/72", "Est. Price:": "$145.00/8 ounces", "Review Date:": "April 2018", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/lotus-ninety-plus/"}, {"rating": "93", "roaster": "Greater Goods Coffee Roasters", "title": "Kenya Ndnunduri", "blind assessment": "Richly sweet, spice-toned. Black currant, molasses, amber oil, allspice, wisteria-like flowers in aroma and cup. Deeply sweet structure; smooth, rounded acidity. The finish displays an unusual sweetly musky quality suggesting amber oil, complicated by black currant and wisteria.", "notes": "This coffee tied for the third-highest rating in a cupping of coffees roasted by women for Coffee Review ‘s April 2018 tasting report. Produced from trees of the SL28 and SL43 varieties of Arabica and processed at the Ndunduri washing station, which supports roughtly 700 member farmers. Despite challenges ranging from unclear government coffee policy and urban encroachment on prime coffee lands to chronically unstable weather, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world’s most elegant and distinctive coffees. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts, and through the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "A spice-toned and fruit-laden Kenya cup, distinguished by perfumy, amber-like suggestions throughout.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Kiambu County, south-central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "54/78", "Est. Price:": "$17.00/12 ounces", "Review Date:": "April 2018", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kenya-ndnunduri/"}, {"rating": "94", "roaster": "Equator Coffees & Teas", "title": "Yemen Port of Mokha Al-Durrar", "blind assessment": "Intensely rich, sweetly savory. Dried raspberry, aged rum, paprika, pipe tobacco, wisteria-like flowers in aroma and cup. Sweet-savory in structure with gentle acidity; full, velvety mouthfeel. The flavor-saturated finish fulfills the promise of the cup, carrying over each of the distinct fruit, earth, spice and chocolate notes, together with a hint of sweet ferment suggesting aged rum.", "notes": "This coffee tied for the second-highest rating in a cupping of coffees roasted by women for Coffee Review ‘s April 2018 tasting report. Although Ethiopia is the botanical home of Coffea arabica , Yemen introduced the beverage to the rest of the world in the 16th and 17th centuries, and Yemeni coffee is still grown from ancient heirloom cultivars of Arabica on stone-walled terraces ringing fortress-like mountaintop villages. All Yemen coffees are natural-processed, i.e., dried in the whole fruit. Imported by Mokhtar Alkhanshali of Port of Mokha Coffee, who has worked with farmers to improve their harvesting and drying procedures, and who selects and meticulously transports microlots like this one to the U.S. Founded in 1995, Equator Coffees & Teas is a women-owned wholesale coffee roasting company that focuses on sustainability in coffee-sourcing and business practices. Visit www.equatorcoffees.com or call 800-809-7687 for more information.", "bottom line": "A gorgeous Yemen coffee that rewards the observant drinker with layers of nuance that unfold with patience, touching all the notes: fruit, earth, chocolate, spice.", "Roaster Location:": "San Rafael, California", "Coffee Origin:": "Al-Durrar, Sana’a Governorate, Yemen", "Roast Level:": "Medium-Light", "Agtron:": "50/76", "Est. Price:": "$30.50/4 ounces", "Review Date:": "April 2018", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/yemen-port-of-mokha-al-durrar/"}, {"rating": "91", "roaster": "Espresso Republic", "title": "Static Indonesia Toarco Sulawesi", "blind assessment": "Crisp, sweetly savory. Butterscotch, mesquite, cocoa powder, cooked acorn squash, fine musk in aroma and cup. Sweet-savory in structure with brisk acidity; lightly syrupy mouthfeel. The finish is carried, both short and long, by notes of cocoa and rich aromatic wood.", "notes": "Toarco (TOraja ARabica COffee) is a coffee project in the famous Sulawesi coffee growing region of Toraja developed and financed by Japan’s Key Coffee Company and its Indonesian partners. Toarco coffees are processed by variants of the orthodox wet or washed method, giving them a brighter and cleaner profile than Sulawesi coffees processed by the locally traditional wet-hulling method. Until recently Toarco sold its entire production to the Japanese market, making this coffee rare in the United States. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.", "bottom line": "A sweet, richly savory Sulawesi cup with a cocoa and mesquite throughline nuanced by butterscotch and fine musk.", "Roaster Location:": "Chino, California", "Coffee Origin:": "Toraja growing region, south-central Sulawesi, Indonesia", "Roast Level:": "Medium-Light", "Agtron:": "52/78", "Est. Price:": "$20.00/12 ounces", "Review Date:": "March 2018", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/static-indonesia-toarco-sulawesi/"}, {"rating": "89", "roaster": "Jackrabbit Java", "title": "Decaf Espresso", "blind assessment": "Evaluated as espresso. Crisp, richly sweet. Dark chocolate, lily, caramelized walnut, grapefruit zest, fresh-cut fir in aroma and small cup. Lightly syrupy body; richly drying, citrus-toned finish. Chocolaty and floral-toned in three parts milk.", "notes": "This coffee was sourced by the importer Royal Coffee, decaffeinated at the Descamex plant in Mexico by a water-only process that does not involve use of solvents, and sold to roasters under the name “Royal Select Water Decaf.” Certified organically grown and Fair Trade, meaning it was purchased at a formula-determined “fair” or economically sustainable price. Jackrabbit Java selects the finest coffees from around the world and roasts them in Thermopolis, Wyoming’s mountain air. All Jackrabbit Java coffees are specialty-grade and roasted to order. Visit www.jackrabbitjava.com for more information.", "bottom line": "An inviting decaffeinated espresso laden with notes of dark chocolate and sweet florals. Particularly appealing in cappuccino-scaled milk.", "Roaster Location:": "Thermopolis, Wyoming", "Coffee Origin:": "Peru", "Roast Level:": "Medium-Light", "Agtron:": "52/72", "Est. Price:": "$12.00/12 ounces", "Review Date:": "March 2018", "Aroma:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "7", "With Milk:": "8", "url": "https://www.coffeereview.com/review/decaf-espresso-2/"}, {"rating": "95", "roaster": "Hula Daddy Kona Coffee", "title": "Kona Mocca®", "blind assessment": "Crisp, delicate, yet intense and original. Lush, rose-like flowers, dark chocolate, cedar, almond, ripe pineapple in aroma and cup. Balanced and complete in structure, poised at a round, satisfying intersection of sweet, tart and bitter. Light but syrupy in texture. Layered and resonant in the finish: rose, chocolate, almond all ring on.", "notes": "Mocca (also spelled Moka and Mokka) is a famous variety of Arabica that reached Kaanapali, Hawaii from Brazil. Current thinking in the technical coffee community is that it originated in the Reunion Islands as a mutant of the great Bourbon variety. I continue to feel that it must have some direct relationship with Yemen, however, where varieties displaying the same, very unusual bean size and shape are known as Ismaili, as well as by other local names. This Mocca was processed by the dry or “natural” method, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. This rare coffee with its tiny beans and striking cup is available only on the Hula Daddy website through their allocation list. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "An out-of-the-ordinary coffee but a superbly balanced and complete one, with particularly seductive floral and chocolate notes.", "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium", "Agtron:": "46/62", "Est. Price:": "$44.95/8 ounces", "Review Date:": "February 2018", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/kona-mocca/"}, {"rating": "92", "roaster": "Grounds for Change", "title": "Congo Kivu", "blind assessment": "Deeply rich, sweetly tart. Baker’s chocolate, grapefruit zest, molasses, tea rose, marjoram in aroma and cup. Balanced, sweet-savory in structure; plump, velvety mouthfeel. The finish is crisp and dry, but also richly sweet, with notes of chocolate and spice-toned florals.", "notes": "This coffee tied for the third-highest rating in a cupping of Value Coffees for Coffee Review ‘s March 2018 tasting report. Produced entirely from trees of the Bourbon variety of Arabica. This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Grounds for Change is a certified organic coffee roaster specializing in sustainable coffee and supporting a wide range of progressive ecological and social programs. The complete carbon footprint (from crop to cup) for this coffee has been offset with tree planting (carbonfund.org). Visit www.groundsforchange.com or call 800-796-6820 for more information.", "bottom line": "Inviting notes of chocolate and tea rose carry this resonant, sweetly tart, slightly darker-roasted coffee from central Africa.", "Roaster Location:": "Poulsbo, Washington", "Coffee Origin:": "Kahale, South Kivu Province, Democratic Republic of the Congo", "Roast Level:": "Medium-Dark", "Agtron:": "45/54", "Est. Price:": "$11.35/12 ounces", "Review Date:": "March 2018", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/congo-kivu/"}, {"rating": "92", "roaster": "Jackrabbit Java", "title": "Sumatra Tano Batak", "blind assessment": "Pungent and earthy with a quietly persuasive sweetness. Fresh clay, grapefruit zest, baker’s chocolate, vanilla bean, ripe pear in aroma and cup. Sweet/savory in structure; light but plush mouthfeel. Clay, grapefruit and vanilla carry into an impressively resonant, layered finish.", "notes": "This coffee tied for the third-highest rating in a cupping of Value Coffees for Coffee Review ‘s March 2018 tasting report. Coffees like this one from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet-hulling.” Produced in the Lintong region south of Lake Toba, one of the oldest and arguably the most admired of Sumatra growing regions. Jackrabbit Java selects the finest coffees from around the world and roasts them in Thermopolis, Wyoming’s mountain air. All Jackrabbit Java coffees are specialty-grade and roasted to order. Visit www.jackrabbitjava.com for more information.", "bottom line": "A classic Sumatra that displays its clean, fresh-earth character and grapefruity pungency without apology, supported by crisp chocolate, vanilla bean and pear.", "Roaster Location:": "Thermopolis, Wyoming", "Coffee Origin:": "Lintong growing region, North Sumatra Province, Indonesia", "Roast Level:": "Medium", "Agtron:": "47/69", "Est. Price:": "$12.00/12 ounces", "Review Date:": "March 2018", "Aroma:": "9", "Acidity/Structure:": "7", "Body:": "8", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/sumatra-tano-batak-5/"}, {"rating": "90", "roaster": "Coava Coffee Roasters", "title": "Honduras David Mancia", "blind assessment": "High-toned, crisply sweet. Roasted cacao nib, apricot, freesia, oak, toffee in aroma and cup. Sweet-toned in structure with brisk, juicy acidty; silky mouthfeel. The finish centers around cocoa-toned stone fruit with hints of spicy floral notes.", "notes": "Produced from trees of the Pacas and Catimor varieties of Arabica on the two-hectare farm of David Mancia in the Honduran village of El Cielito at an elevation of over 5,000 feet. Processed by the wet or washed method (fruit skin and pulp are removed before drying). Coava is a Portland-based coffee roaster, now with a San Diego location as well, that aims to provide quality coffee and education regarding the preparation of good coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": "A pleasing stone fruit and cocoa-driven Honduras cup, bright and lively.", "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Santa Barbara Department, Honduras", "Roast Level:": "Light", "Agtron:": "58/84", "Est. Price:": "$15.00/250 grams", "Review Date:": "February 2018", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/honduras-david-mancia-2/"}, {"rating": "94", "roaster": "Red Rooster Coffee Roaster", "title": "Ethiopia Banko Gotiti", "blind assessment": "Resonantly fruit-forward, elegant, complex. Honey, dried raspberry, chocolate truffle, aged rum, a hint of marjoram in aroma and cup. Juicy, rich structure with bright, vibrant acidity; full, satiny mouthfeel. A suggestion of sweet marjoram complicates the rich, flavor-saturated finish, which leads with honey and raspberry notes in the short, rounding to chocolate and aged rum in the long.", "notes": "Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. This coffee is certified organically grown and Fair Trade Certified, meaning it was purchased from small-holding farmers at a “fair” or economically sustainable price. Established in 2010, Red Rooster is an organic-certified micro-roaster focusing on socially conscious coffee and high-quality coffee. Visit redroostercoffee.com or call 540-745-7338 for more information.", "bottom line": "A juicy-sweet Ethiopia natural cup: lively and fruit-toned, with a hint of elegant, rum-like sweet ferment.", "Roaster Location:": "Floyd, Virginia", "Coffee Origin:": "Kochere, Yirgacheffe growing region, south-central Ethiopia", "Roast Level:": "Light", "Agtron:": "65/93", "Est. Price:": "$16.99/12 ounces", "Review Date:": "January 2018", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-banko-gotiti/"}, {"rating": "92", "roaster": "Espresso Republic", "title": "Static Kenya Kavutiri", "blind assessment": "Delicate, sweetly spice-toned. Red currant, lemon verbena, baker’s chocolate, rose hips, a hint of cannabis in aroma and cup. Crisply sweet-savory structure; crisp, velvety mouthfeel. The finish is sweetly herb-toned, leading with notes of lemon verbena and red currant in the short and a sweet muskiness akin to cannabis in the long, with a throughline of baker’s chocolate.", "notes": "Produced by smallholding farmers from trees of the Ruiru 11, Batian, SL28 and SL34 varieties of Arabica. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.", "bottom line": "A delicate, spice-driven Kenya cup with engaging undercurrents of fruit, floral and chocolate.", "Roaster Location:": "Chino, California", "Coffee Origin:": "Kiambu County, south-central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "53/79", "Est. Price:": "$25.00/12 ounces", "Review Date:": "December 2017", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/static-kenya-kavutiri/"}, {"rating": "96", "roaster": "Coava Coffee Roasters", "title": "David Mburu Kenya", "blind assessment": "Deep, complex, richly sweet-savory. Vanilla orchid, toasted coconut, fine musk, dried fig, dark caramel in aroma and cup. Elegant, savory-leaning structure with bright, juicy acidity; plush, velvety mouthfeel. The resonant, flavor-laden finish is centered around floral-toned fruit, with supporting notes of dark caramel and fine musk.", "notes": "Produced by David Mburu Mwangi at his farm in Kenya’s Kiambu East District from trees of the Ruiru 11, SL28 and SL34 varieties of Arabica. Despite challenges ranging from contested government coffee policy and urban encroachment on prime coffee lands to chronically unstable weather, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Coava is a Portland-based coffee roaster, now with a San Diego location as well, that aims to provide quality coffee and education regarding the preparation of good coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": "A big, juicy Kenya that invokes the tropics: resonant notes of aromatic orchid and coconut, along with hints of elegant musk and dried fig.", "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Kiambu County, south-central Kenya", "Roast Level:": "Light", "Agtron:": "58/84", "Est. Price:": "$15.00/250 grams", "Review Date:": "December 2017", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/david-mburu-kenya/"}, {"rating": "89", "roaster": "Espresso Republic", "title": "Static Colombia Decaf Midnight", "blind assessment": "Deeply sweet, chocolate-toned. Dark chocolate, Brazil nut, gardenia, baked apple, cedar in aroma and cup. Roundly sweet in structure; lean, lightly syrupy body. The gently drying finish is characterized by notes of dark chocolate throughout, supported by gardenia and apple tones in the short and cedar in the long.", "notes": "Decaffeinated at the Descamex plant in Mexico by the “Mountain Water Process” which does not involve use of solvents. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.", "bottom line": "A solid, chocolate-toned decaf with inviting fruit and floral tones.", "Roaster Location:": "Chino, California", "Coffee Origin:": "Huila, Colombia", "Roast Level:": "Medium", "Agtron:": "48/58", "Est. Price:": "$16.95/12 ounces", "Review Date:": "December 2017", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/static-brazil-decaf-midnight/"}, {"rating": "95", "roaster": "Hula Daddy Kona Coffee", "title": "100% Kona Bourbon Pointu Laurina", "blind assessment": "Sweet, deep, intense but balanced. Peach, maple syrup, sandalwood, grapefruit zest, almond, magnolia in aroma and cup. Round, resonantly and sweetly bright in structure. Silky and buoyant in mouthfeel. Deep, long, flavor-saturated finish.", "notes": "This exceptional coffee was selected as the No. 10 coffee on Coffee Review’s list of the Top 30 Coffees of 2017. Bourbon Pointu, botanical name var. Laurina, is a rare variety of Arabica that is a natural mutation of the famous Bourbon variety first selected on Reunion Island in the Indian Ocean. The Bourbon Pointu is famous for its natural low levels of caffeine, bean shape (small and tending to be pointed at the ends, hence “pointu”), and pungently fruit-toned, Bourbon-like cup. This version was produced in Kona, Hawaii and processed with the ferment step conducted “dry” (no water added to the tank) using a commercial yeast. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This rare coffee is only available on the Hula Daddy website through their allocation list. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "Intense, bright but balanced cup with layered aromatic intrigue generated by a celebrated and rare tree variety.", "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "52/76", "Est. Price:": "$44.95/8 ounces", "Review Date:": "November 2017", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/100-kona-bourbon-pointu-laurina-3/"}, {"rating": "92", "roaster": "Jackrabbit Java", "title": "Kenya Nyeri Othaya Gatugi Red Cherry Project AA", "blind assessment": "Sweetly pungent, gently roasty. Scorched cedar, dark chocolate, plum, lavender, lime zest in aroma and cup. Complex in structure: sweetly tart with a roasty, savory depth. Light, satiny mouthfeel. Lemon zest, dark chocolate, plum carry into a rich though drying finish.", "notes": "Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. This coffee is the result of a partnership between the Othaya and Aguthi Cooperatives and Royal Coffee, intended to create a methodology for isolating and enhancing the highest quality coffees coming from these cooperatives. Produced from trees of the SL28, SL34, Ruiru 11 and Batian varieties of Arabica. AA is the highest grade of Kenya coffee based on bean size and freedom from physical imperfections. Jackrabbit Java selects the finest coffees from around the world and roasts them in Thermopolis, Wyoming’s mountain air. All Jackrabbit Java coffees are specialty-grade and roasted to order. Visit www.jackrabbitjava.com for more information.", "bottom line": "A darker roast develops a savory-toned chocolate to complement a zesty citrus in this pleasingly contradictory Kenya.", "Roaster Location:": "Thermopolis, Wyoming", "Coffee Origin:": "Nyeri growing region, south-central Kenya", "Roast Level:": "Medium-Dark", "Agtron:": "38/52", "Est. Price:": "$18.00/12 ounces", "Review Date:": "November 2017", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kenya-nyeri-othaya-gatugi-red-cherry-project-aa/"}, {"rating": "97", "roaster": "Hula Daddy Kona Coffee", "title": "100% Kona SL-28", "blind assessment": "Spectacularly sweet and hugely aromatic. Meyer lemon marmalade, cedar, pistachio, guava, jasmine in aroma and cup. Crisply sweet/tart and massively juicy in structure; plush, buoyant mouthfeel. The juicy structure and complex aromatics persist in a long, lingering finish.", "notes": "This exceptional coffee was selected as the No. 2 coffee on Coffee Review’s list of the Top 30 Coffees of 2017. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced entirely from trees of the distinguished SL-28 variety of Arabica, the most celebrated of the Bourbon-derived tree varieties responsible for Kenya’s finest coffees. This SL-28 was grown at the higher elevation Hula Daddy farm and processed with the ferment step conducted “dry” (no water added to the tank) using a commercial yeast. It is a limited edition coffee only available for sale through the allocation list on the Hula Daddy website. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "Coffee simply doesn’t get much better than this. Transcendently classic.", "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "56/78", "Est. Price:": "$74.95/8 ounces", "Review Date:": "November 2017", "Aroma:": "10", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/100-kona-sl-28/"}, {"rating": "94", "roaster": "Equator Coffees & Teas", "title": "Panama Elida Green Tip Gesha Natural", "blind assessment": "Spice-toned, richly sweet. Raspberry, dark chocolate, hazelnut, gardenia, bergamot in aroma and cup. Sweet, fruit-forward structure; full, satiny mouthfeel. The resonant, flavor-saturated finish is characterized by notes of rich chocolate with berry and bittersweet citrus complications.", "notes": "This coffee tied for the third-highest rating in a tasting of holiday coffees for Coffee Review ‘s December 2017 tasting report. Produced entirely from trees of the respected Catuai variety of Arabica. The Lamastus family’s Elida Estate averages the highest growing elevations in Panama: 5,500 to 8,200 feet (1,700 to 2,500 meters). This is a “natural” or dry-processed coffee, meaning the beans were dried inside the fruit, encouraging a flavor profile that is sweeter and deeper-toned than the more familiar wet-processed coffees of Panama. Founded in 1995, Equator Coffees & Teas is a women-owned wholesale coffee roasting company that focuses on sustainability in coffee-sourcing and business practices. Visit www.equatorcoffees.com or call 800-809-7687 for more information.", "bottom line": "An elegant, richly sweet natural-processed Panama Gesha with berry and chocolate notes throughout.", "Roaster Location:": "San Rafael, California", "Coffee Origin:": "Boquete growing region, western Panama", "Roast Level:": "Medium-Light", "Agtron:": "53/77", "Est. Price:": "$37.00/4 ounces", "Review Date:": "December 2017", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/panama-elida-green-tip-gesha-natural/"}, {"rating": "93", "roaster": "Red Rooster Coffee Roaster", "title": "Ethiopia Kayon Mountain", "blind assessment": "Delicate, richly and sweetly tart. Dried hibiscus, fine musk, almond, sandalwood, raspberry in aroma and cup. Fruit-toned, deeply sweet structure with gently-expressed acidity; buoyant, satiny-smooth mouthfeel. The crisp, flavor-saturated finish is characterized by sweet-tart fruit and floral tones (raspberry, hibiscus).", "notes": "This coffee tied for the second-highest rating in a tasting of 71 organic-certified coffees from Africa for Coffee Review’s November 2017 tasting report. Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Certified USDA organic. Established in 2010, Red Rooster is an organic-certified micro-roaster focusing on socially conscious coffee and high-quality coffee. Visit redroostercoffee.com or call 540-745-7338 for more information.", "bottom line": "A lively and crisply sweet, fruit-forward natural-processed Ethiopia cup.", "Roaster Location:": "Floyd, Virginia", "Coffee Origin:": "Odo Shakiso District, Guji Zone, southern Ethiopia", "Roast Level:": "Light", "Agtron:": "66/92", "Est. Price:": "$17.49/12 ounces", "Review Date:": "November 2017", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-kayon-mountain-2/"}, {"rating": "89", "roaster": "Espresso Republic", "title": "Static El Salvador Finca Maria Luisa", "blind assessment": "Brisk and subtly layered. Almond butter, dried apricot, fresh-cut fir, hints of dark chocolate and clover in aroma and cup. Sweetly brisk and dry in structure; lightly syrupy mouthfeel. The drying structure sweetens and smoothes a bit in the finish, and chocolate and clover-like flowers move forward.", "notes": "Processed by the wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Espresso Republic, founded in 2010, specializes in sourcing quality coffees and roasting them in small batches for both retail and wholesale customers. Visit www.espressorepublic.com for more information.", "bottom line": "Those who value brisk, dry beverages should enjoy this coffee and its quiet, unorthodox aromatic intrigue.", "Roaster Location:": "Chino, California", "Coffee Origin:": "Santa Rosa, La Unión Department, El Salvador", "Roast Level:": "Medium-Light", "Agtron:": "55/77", "Est. Price:": "$11.90/12 ounces", "Review Date:": "November 2017", "Aroma:": "8", "Acidity/Structure:": "7", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/static-el-salvador-finca-maria-luisa/"}, {"rating": "90", "roaster": "Jackrabbit Java", "title": "Panama Finca San Sebastian", "blind assessment": "Crisp, richly sweet. Lemon blossom, caramelized banana, fir, nutmeg, baker’s chocolate in aroma and cup. Bittersweet structure with mild acidity; lean, satiny mouthfeel. The gently drying finish leads with citrusy floral notes and caramelized banana in the short, consolidating to crisp, nutmeg-toned cocoa in the long.", "notes": "Produced at Finca San Sebastian from trees of the Catuai and Typica varieties of Arabica. Processed by the wet or washed method (fruit skin and pulp are removed before drying). Jackrabbit Java selects the finest coffees from around the world and roasts them in Thermopolis, Wyoming’s fresh mountain air. All Jackrabbit Java coffees are specialty-grade and roasted to order. Visit www.jackrabbitjava.com for more information.", "bottom line": "A straight-ahead Panama cup: crisp, citrus- and chocolate-toned with inviting tropical fruit notes.", "Roaster Location:": "Thermopolis, Wyoming", "Coffee Origin:": "Boquete growing region, western Panama", "Roast Level:": "Medium-Light", "Agtron:": "52/74", "Est. Price:": "$12.00/12 ounces", "Review Date:": "October 2017", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/panama-finca-san-sebastian/"}, {"rating": "94", "roaster": "Greater Goods Coffee Roasters", "title": "Kenya Nyeri Hill Farm", "blind assessment": "Balanced, richly sweet, spice-toned. Apricot, baker’s chocolate, lilac, coriander, fresh-cut cedar in aroma and cup. Deep, sweet-savory structure with bright acidity; crisp, satiny mouthfeel. The finish is paradoxically dry yet juicy, leading with resonant notes of apricot and fresh-ground coriander in the short and cocoa-toned sweet florals in the long.", "notes": "Produced by the Archdiocese of Nyeri from trees of the SL28 and SL34 varieties of Arabica. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts, and through the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "A thrilling ride of a Kenya: balanced, deep, rich, and intriguingly spice-toned.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Nyeri growing region, south-central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "55/79", "Est. Price:": "$18.00/12 ounces", "Review Date:": "October 2017", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/kenya-nyeri-hill-farm-2/"}, {"rating": "92", "roaster": "Magnolia Coffee", "title": "Costa Rica Cumbres del Poas “Perla Negra”", "blind assessment": "Delicate, sweetly tart. Dried peach, roasted cacao nib, lavender, pink peppercorn, lemon zest in aroma and cup. Crisply sweet-tart in structure; delicate, silky mouthfeel. The finish consolidates around roasted cacao nib, gently drying, with hints of lemon zest.", "notes": "Produced by Oscar and Francisca Chacon entirely from trees of the Caturra variety of Arabica; certified organically grown. Processed by “natural” or dry method, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft Roasted. Truly Delicious. Socially Conscious.” Magnolia Coffee focuses on direct-trade coffees that make a difference in the lives of the coffee harvesters and the local communities they serve. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": "An engaging natural-processed Costa Rica driven by spicy floral notes and suggestions of dried stone fruit. Organically grown.", "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Sabanilla de Alajuela growing region, Costa Rica", "Roast Level:": "Medium-Light", "Agtron:": "52/74", "Est. Price:": "$14.99/12 ounces", "Review Date:": "October 2017", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/costa-rica-cumbres-del-poas-perla-negra/"}, {"rating": "90", "roaster": "Topeca Coffee Roasters", "title": "Ethiopia Shakisso", "blind assessment": "Sweet-toned and delicately tart. Blood orange, fresh-cut cedar, almond, honeysuckle, marjoram in aroma and cup. Tart and lightly zesty in structure; lightly plush in mouthfeel. Crisp and sweet in the finish with a richly drying edge; flavor notes consolidate but linger.", "notes": "Southern Ethiopia coffees like this one are produced from traditional Ethiopian varieties of Arabica long grown in the region. When processed by the wet or washed method (fruit skin and pulp are removed before drying) they typically express great aromatic complexity and intensity with a particular emphasis on floral notes. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Topéca Coffee is an artisan roaster with three café locations and a roastery in Tulsa, Oklahoma. Visit www.topecacoffee.com or call 918-398-8022 for more information.", "bottom line": "A light-footed, vivacious wet-processed Ethiopia cup. Might make a refreshing cold or iced coffee.", "Roaster Location:": "Tulsa, Oklahoma", "Coffee Origin:": "Guji Zone, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "54/74", "Est. Price:": "$15.99/12 ounces", "Review Date:": "September 2017", "Aroma:": "8", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/ethiopia-shakisso/"}, {"rating": "94", "roaster": "San Francisco Bay Coffee", "title": "Panama Geisha", "blind assessment": "Roast-encapsulated complexity; sweetly and exhilaratingly pungent. \r\nRichly scorched cedar, rose-like flowers, orange zest, black sage, a hint of cocoa-ish chocolate in aroma and cup. Bittersweet but zesty in structure; light though plush mouthfeel. Flowers and cocoa in particular carry into a roasty but cleanly sweet-toned finish.", "notes": "This exceptional coffee was selected as the No. 27 coffee on Coffee Review’s list of the Top 30 Coffees of 2017. It was also recognized as one of the three most exciting darker roasts of 2017 . This coffee tied for the third-highest rating in a tasting of 20 coffees of the Gesha (also spelled Geisha) variety for Coffee Review ‘s September 2017 tasting report. With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha continues to distinguish itself as one of the world’s most unique coffees. This coffee was produced on Finca Santa Barbara, named after Barbara Rogers, Vice-President of the Rogers Family Company. San Francisco Bay is one of five coffee brands produced by the family-owned Rogers Family Company. Visit www.sfbaycoffee.com or call 800-829-1300 for more information.", "bottom line": "Intensely sweet, intensely roasty, intensely Gesha. And given it’s Gesha, an impressive value.", "Roaster Location:": "Lincoln, California", "Coffee Origin:": "Boquete growing region, western Panama", "Roast Level:": "Medium-Dark", "Agtron:": "34/52", "Est. Price:": "$29.99/12 ounces", "Review Date:": "September 2017", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/panama-geisha-2/"}, {"rating": "94", "roaster": "Topeca Coffee Roasters", "title": "Kenya Boma Peaberry", "blind assessment": "Crisply sweet, gently spicy. Honey, bergamot, white sage, musk, fragrant lavender in aroma and cup. In structure richly tart with a rounding, enveloping sweetness. Full, buoyantly syrupy mouthfeel. A lemony sweetness dominates in a resonant finish.", "notes": "Produced by smallholding farmers from trees of the Ruiru 11, Batian, SL28 and SL34 varieties of Arabica. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. This particular sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Topéca Coffee is an artisan roaster with three café locations and a roastery in Tulsa, Oklahoma. Visit www.topecacoffee.com or call 918-398-8022 for more information.", "bottom line": "Classic Kenya cup: honey, citrus and spice.", "Roaster Location:": "Tulsa, Oklahoma", "Coffee Origin:": "Baringo and Nakura Counties, central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "54/76", "Est. Price:": "$16.99/12 ounces", "Review Date:": "September 2017", "Aroma:": "9", "Acidity/Structure:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kenya-boma-peaberry/"}, {"rating": "93", "roaster": "Coava Coffee Roasters", "title": "Kilenso Ethiopia Natural", "blind assessment": "Deep, layered, intricate, very sweet. Raspberry, roasted cacao nib, mango, complex flowers (jasmine, lavender, rose), myrrh, a hint of spirits—Brazilian cachaça perhaps. Richly sweet/tart in structure; full, syrupy mouthfeel. Flavor consolidates in a long, bittersweet finish.", "notes": "Produced by farmers of Kilenso Mokonissa village in the Borena Hagermariam District of the Sidama Zone of southern Ethiopia. Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. Like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. This is a dry-processed or “natural” coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Coava is a Portland-based coffee roaster that aims to provide quality coffee and education regarding the preparation of good coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": "A lush, resonant dried-in-the-fruit coffee with a brisk edge: a fruit-bomb for grown-ups.", "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Sidama (also Sidamo) growing region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "55/76", "Est. Price:": "$15.00/250 grams", "Review Date:": "August 2017", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kilenso-ethiopia-natural/"}, {"rating": "92", "roaster": "Oceana Coffee", "title": "Sumatra Tanah Karo", "blind assessment": "Sweet/savory, chocolaty. Spicy chocolate, plum, rosemary, lightly scorched pine, lantana-like flowers in aroma and cup. Distinctly sweet/savory in structure; plushly syrupy in mouthfeel. Dries and simplifies a bit in the finish, though sweet hints of chocolate and fruit persist.", "notes": "Coffees like this one from the northern part of the Indonesian island of Sumatra are admired for their complex aromatic wood and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet hulling.” This coffee tied for the fourth-highest rating in a tasting of nearly 130 darker-roasted coffees for Coffee Review ‘s August 2017 tasting report. Established in 2009 by Amy and Scott Angelo, Oceana brews specialty coffees that have been roasted in small batches at its roasting house and café in Tequesta, Florida. Oceana reports that its staff is obsessed with every detail of the process, from sourcing the beans to how the coffee is poured, aimed at insuring that every cup is as rich and resonant as it should be. Visit www.oceanacoffee.com for more information.", "bottom line": "A rich, idiosyncratic version of an already idiosyncratic coffee type, a darker roasted wet-hulled Sumatra. We didn’t register much of the famous Sumatra earth or pipe tobacco, but we did get a big, spicy yet fudgy chocolate and a complex pungent sweetness.", "Roaster Location:": "Tequesta, Florida", "Coffee Origin:": "Northern Sumatra, Indonesia", "Roast Level:": "Medium-Dark", "Agtron:": "39/49", "Est. Price:": "$15.75/12 ounces", "Review Date:": "August 2017", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/sumatra-tanah-karo/"}, {"rating": "90", "roaster": "Magnolia Coffee", "title": "Dreamlands Blend", "blind assessment": "Sweetly roast-toned: aromatic wood and flowers. Hazelnut, scorched cedar, orange zest, magnolia, cocoa in aroma and cup. Quietly bittersweet and zesty structure; smoothly satiny mouthfeel. Cocoa and scorched wood animate a rather dry finish.", "notes": "A blend created by Magnolia founder Jay Gestwicki in honor of his father. Proceeds from the sale of this coffee in North Carolina support clean water initiatives by the North Carolina Wildlife Federation. This coffee tied for the sixth-highest rating in a tasting of nearly 130 darker-roasted coffees for Coffee Review ‘s August 2017 tasting report. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft roasted. Truly delicious. Socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": "Unusual juxtaposition of aromatic wood, flowers and cocoa animate a zesty, bittersweet medium-dark-roasted blend.", "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Not disclosed", "Roast Level:": "Medium-Dark", "Agtron:": "45/55", "Est. Price:": "$12.99/12 ounces", "Review Date:": "August 2017", "Aroma:": "9", "Acidity/Structure:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/dreamlands-blend/"}, {"rating": "92", "roaster": "Equator Coffees and Teas", "title": "Rwanda Nyampinga", "blind assessment": "Delicate, crisply sweet. Jasmine, cedar, pink grapefruit zest, mango, roasted cacao nib in aroma and cup. Round, gentle acidity; satiny mouthfeel. The sweetly savory finish is carried by cocoa-toned floral notes with hints of citrus zest.", "notes": "The word “Nyampinga” refers to the coming of age of a young woman who is proud, beautiful and respected in her community. Since 2013, the Nyampinga Women’s Cooperative has received training in agronomy, market access, and quality control from Sustainable Harvest Rwanda, supported by a grant from Bloomberg Philanthropies. Processed by the conventional wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. This coffee tied for the fourth-highest rating in a tasting of women-produced coffees for Coffee Review ‘s June 2017 tasting report. Founded in 1995, Equator Coffees & Teas is a women-owned wholesale coffee roasting company that focuses on sustainability in coffee-sourcing and business practices. Visit www.equatorcoffees.com or call 800-809-7687 for more information.", "bottom line": "A sweet, floral-toned Rwanda cup with ballast from tart citrus and savory aromatic wood notes.", "Roaster Location:": "San Rafael, California", "Coffee Origin:": "Nyaruguru, southern Rwanda", "Roast Level:": "Medium-Light", "Agtron:": "55/76", "Est. Price:": "$15.95/12 ounces", "Review Date:": "June 2017", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/rwanda-nyampinga/"}, {"rating": "94", "roaster": "Hula Daddy Kona Coffee", "title": "Bourbon Peaberry", "blind assessment": "Richly sweet, deeply savory. Lime zest, white peppercorn, milk chocolate, sandalwood, dried coconut in aroma and cup. Lively, lyrical acidity; full, syrupy mouthfeel. The flavor-saturated finish is laden with all the notes promised by both aroma and flavor, though the lime zest softens to lime blossom as the finish lengthens and turns resonantly floral.", "notes": "Produced from trees of the admired heirloom Bourbon variety of Arabica. This particular sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm. This rare coffee is only available on the Hula Daddy website through their allocation list. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "Unusual, pleasing and wide-ranging in aroma and flavor, from chocolate to citrus blossom and savory spice to hints of tropical fruit.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "54/80", "Est. Price:": "$49.95/8 ounces", "Review Date:": "May 2017", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/bourbon-peaberry/"}, {"rating": "91", "roaster": "San Francisco Bay Coffee", "title": "Wine-Barrel-Aged Ethiopia", "blind assessment": "Very sweet; quietly layered complexity. Dried jasmine, alcohol-toned raspberry, roasted cacao nib, scorched oak, grapefruit zest in aroma and cup. Light-footed, delicate acidity; light, silky mouthfeel. Floral and raspberry notes carry into a rather dry, roast-dominated finish.", "notes": "A wet-processed or washed coffee from the celebrated southern Ethiopia growing region of Yirgacheffe that after shipping was aged for six months in seasoned American oak wine barrels. This coffee earned the fourth-highest rating in a cupping of aged, casked and specially cured coffees for Coffee Review ‘s May 2017 tasting report. San Francisco Bay is one of five coffee brands produced by the family-owned Rogers Family Company. Visit www.sfbaycoffee.com or call 800-829-1300 for more information.", "bottom line": "This complex expression of delicate but powerfully aromatic green coffee, a hint of wine-toned alcohol and distinct roast notes should please those who like a roasty but nuanced and original cup.", "Roaster Location:": "Lincoln, California", "Coffee Origin:": "Yirgacheffe growing region, southern Ethiopia", "Roast Level:": "Medium-Dark", "Agtron:": "36/46", "Est. Price:": "$19.99/12 ounces", "Review Date:": "May 2017", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/wine-barrel-aged-ethiopia/"}, {"rating": "94", "roaster": "Equator Coffees & Teas", "title": "Aged Sumatra Ulos Batak Peaberry", "blind assessment": "Complexly structured; tart, sweet-savory, balanced. Mango, cedar, molasses, fresh pipe tobacco, grapefruit zest in aroma and cup. Gently crisp acidity; plush, syrupy mouthfeel. Tobacco, cedar and the mango-like fruit carry into a quiet finish.", "notes": "This exceptional coffee was selected as the No. 18 coffee on Coffee Review’s list of the Top 30 Coffees of 2017. An unusual coffee in several respects. Coffees like this one from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet hulling.” This is a particularly refined example of the type. In addition, this coffee was subjected to a deliberate aging process by being held for three years in a specialized warehouse in Singapore. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. This coffee tied for the highest rating in a cupping of aged, casked and specially cured coffees for Coffee Review ‘s May 2017 tasting report. Founded in 1995, Equator Coffees & Teas is a women-owned wholesale coffee roasting company that focuses on sustainability in coffee-sourcing and business practices. Visit www.equatorcoffees.com or call 800-809-7687 for more information.", "bottom line": "The great wet-hulled Sumatra profile takes on a particularly graceful resonance in this traditionally aged version.", "Roaster Location:": "San Rafael, California", "Coffee Origin:": "Dolok Sanggul, Lintong growing region, North Sumatra, Indonesia", "Roast Level:": "Medium-Light", "Agtron:": "53/73", "Est. Price:": "$18.00/12 ounces", "Review Date:": "May 2017", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/aged-sumatra-ulos-batak-peaberry/"}, {"rating": "90", "roaster": "Jackrabbit Java", "title": "Costa Rica Microlot White Honey", "blind assessment": "Sweetly pungent, roast-rounded. Dark chocolate, floral vanilla, orange zest, scorched cedar in aroma and cup. Pungent, bittersweet acidity, lightly syrupy mouthfeel. Bittersweet but resonant in the finish: Chocolate and orange dominate in a bittersweet but resonant finish.", "notes": "Produced by Helsar Magdalena of Santa Lucia Farm of the Caturra and Catuai varieties of Arabica. Processed by the white honey method. With all honey processing methods, some sweet pulp or fruit flesh (“honey”) is allowed to adhere to the beans during drying. In the white honey variation, an extremely thin layer of pulp is allowed to dry on the beans, less than with yellow honey, and much less than is the case with red or black honey. Jackrabbit Java selects the finest coffees from around the world and roasts them in Thermopolis Wyoming's fresh mountain air. All Jackrabbit Java coffees are specialty-grade and roasted to order. Visit www.jackrabbitjava.com for more information.", "bottom line": "Attractive darker-roasted Costa Rica, pungent and chocolaty with a zesty orange edge.", "Roaster Location:": "Thermopolis, Wyoming", "Coffee Origin:": "Central Valley, Costa Rica", "Roast Level:": "Medium", "Agtron:": "44/58", "Est. Price:": "$12.00/12 ounces", "Review Date:": "April 2017", "Aroma:": "9", "Acidity:": "7", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/costa-rica-microlot-white-honey/"}, {"rating": "91", "roaster": "Jackrabbit Java", "title": "Hopper Blend Espresso", "blind assessment": "Evaluated as espresso. Sweetly roast-toned and crisply chocolaty. Dark chocolate, gently scorched cedar, narcissus-like flowers, raisin in aroma and small cup. Full, syrupy mouthfeel. Rich short finish, rather drying in the long. Dominates milk with a raisin- and floral-nuanced chocolate.", "notes": "Jackrabbit Java selects the finest coffees from around the world and roasts them in Thermopolis Wyoming's fresh mountain air. All Jackrabbit Java coffees are specialty-grade and roasted to order. Visit www.jackrabbitjava.com for more information.", "bottom line": "Crisply roasty, while maintaining plush body and an attractive set of fruit, chocolate and floral notes.", "Roaster Location:": "Thermopolis, Wyoming", "Coffee Origin:": "Not disclosed", "Roast Level:": "Medium-Dark", "Agtron:": "37/47", "Est. Price:": "$12.00/12 ounces", "Review Date:": "April 2017", "Aroma:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "7", "With Milk:": "8", "url": "https://www.coffeereview.com/review/hopper-blend-espresso/"}, {"rating": "96", "roaster": "Hula Daddy Kona Coffee", "title": "100% Kona Bourbon Pointu Laurina", "blind assessment": "Complexly layered, richly sweet-savory. Violet, dried fig, almond butter, ginseng, fine musk in aroma and cup. Bright, sweet-tart acidity; delicate, silky-smooth mouthfeel. The intense, resonant finish is saturated with all the flavor notes from the cup, in particular the fruit and floral tones, which ring on and on.", "notes": "Bourbon Pointu, botanical name var. Laurina, is a rare variety of Arabica that is a natural mutation of the famous Bourbon variety first selected on Reunion Island in the Indian Ocean. The Bourbon Pointu is famous for its natural low levels of caffeine, bean shape (small and tending to be pointed at the ends, hence “pointu”), and pungently fruit-toned, Bourbon-like cup. This version was produced in Kona, Hawaii. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This rare coffee is only available on the Hula Daddy website through their allocation list. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "An exciting and rare coffee with an extraordinarily bright acidity and broad aromatic scope.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "56/76", "Est. Price:": "$49.95/8 ounces", "Review Date:": "February 2017", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/100-kona-bourbon-pointu-laurina-2/"}, {"rating": "91", "roaster": "Greater Goods Coffee Roasters", "title": "Ethiopia Celinga", "blind assessment": "Sweet-toned, spicy. Jasmine, caramel, hazelnut, black peppercorn, fresh-cut fir in aroma and cup. Crisply sweet acidity; light but velvety-smooth mouthfeel. The sweet, gently drying finish consolidates around suggestions of spice-toned caramel.", "notes": "Southern Ethiopia coffees like this one are produced from distinctive traditional Ethiopian varieties of Arabica long grown in the region. And like virtually all southern Ethiopia coffees, this coffee is produced by villagers on small garden plots interplanted with food and other subsistence crops. Processed at the Celinga washing station in the Guanga District by the wet or washed method (fruit skin and pulp are removed before drying). This coffee earned the fourth-highest rating in a cupping of coffees from roasting companies five-years-old or younger for Coffee Review ‘s February 2017 tasting report. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts, and through the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "An accessible washed Ethiopia cup, sweetly balanced and gently animated by floral and spice notes.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Yirgacheffe growing region, south-central Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "56/78", "Est. Price:": "$15.00/12 ounces", "Review Date:": "February 2017", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/ethiopia-celinga/"}, {"rating": "93", "roaster": "Hula Daddy Kona Coffee", "title": "Kahiko Holiday Coffee", "blind assessment": "Intense, deeply aromatic, richly sweet. Dark chocolate, scorched lemon zest, rose, passion fruit, vanilla in aroma and cup. Engaging, fruit-toned acidity; syrupy mouthfeel. The crisp finish consolidates to a cocoa-toned passion fruit with continued appealing notes of lemon zest.", "notes": "Produced entirely from trees of the traditional Guatemala Typica variety of Arabica. This sample also consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Processed by the “natural” method, in which the coffee is dried inside the whole fruit, rather than by the more orthodox “washed” method, in which the soft fruit residue is removed before the beans are dried. Available only on the Hula Daddy website through their allocation list. (Orders must be received by December 11.) This coffee tied for the fourth-highest rating in a tasting of holiday coffees for Coffee Review ‘s December 2016 tasting report. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "A classic revival of the original Kona strain of Typica: sweet-tart fruit notes and rich chocolate and florals. Limited availability.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "52/75", "Est. Price:": "$44.95/8 ounces", "Review Date:": "December 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kahiko-holiday-coffee/"}, {"rating": "95", "roaster": "Hula Daddy Kona Coffee", "title": "Mokka", "blind assessment": "Seductively pungent, richly sweet, tropical. Cognac, almond butter, frankincense, lychee, sandalwood in aroma and cup. Bright, juicy acidity; full, satiny mouthfeel. The crisp finish is richly nut-toned in the short, while tropical fruit notes (lychee) return in the long, along with a pleasing new coconut (the fruit flesh) note.", "notes": "This exceptional coffee was selected as the No. 14 coffee on Coffee Review’s list of the Top 30 Coffees of 2016. Mokka (also spelled Moka and Mocca) is a famous variety of Arabica that reached Kaanapali, Hawaii from Brazil. It almost certainly must have originated in Yemen, however, where varieties identical in bean appearance and cup are known as Ismaili as well as by other local names. Processed by the dry or “natural” method, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. This rare coffee with its tiny beans and striking cup is available only on the Hula Daddy website through their allocation list. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "A rare coffee from an extraordinary, low-bearing variety that is worth the premium you’ll pay for its originality and intense, intricate aromas and flavors.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "54/76", "Est. Price:": "$39.95/8 ounces", "Review Date:": "November 2016", "Aroma:": "10", "Acidity:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/mokka/"}, {"rating": "93", "roaster": "Hula Daddy", "title": "100% Kona High Mountain Io Fancy", "blind assessment": "Rich, deeply floral. Dried mango, narcissus, dark chocolate, marjoram, sandalwood in aroma and cup. Round, balanced acidity; syrupy mouthfeel. The gently drying finish is carried by dark chocolate and sweet marjoram notes.", "notes": "Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm, and processed by the conventional wet or “washed” method, in which skin and fruit flesh are removed from the beans or seeds before they are dried. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "A Kona cup both classically balanced yet distinctive in its sweet herb and floral tones and backgrounded dark chocolate.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "50/74", "Est. Price:": "$36.95/8 ounces", "Review Date:": "November 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/100-kona-high-mountain-io-fancy-2/"}, {"rating": "92", "roaster": "Greater Goods Coffee Roasters", "title": "Life Saver Guatemala Organic Finca La Colina", "blind assessment": "Sweetly and richly enticing. Baker’s chocolate, Graham cracker, dried cranberry, orange blossom, fresh-cut cedar in aroma and cup. Crisp, balanced acidity; satiny mouthfeel. The richly drying finish consolidates to baker’s chocolate in the short finish, with aromatic wood notes resurfacing in the long.", "notes": "Produced by Emilio Antonio Medina García at La Colina Farm from trees of the Caturra and Bourbon varieties of Arabica. Processed by the wet or washed method (fruit skin and pulp are removed before drying). Greater Goods is a small-batch wholesale and retail roasting company in Austin, Texas. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts, and through the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "A solid Guatemala cup: deeply sweet, with a chocolate throughline.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Chimaltenango Department, Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "58/74", "Est. Price:": "$15.00/12 ounces", "Review Date:": "November 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/life-saver-guatemala-organic-finca-santa-rita-2/"}, {"rating": "93", "roaster": "Magnolia Coffee", "title": "Costa Rica Signature Reserve Don Pepe", "blind assessment": "Evaluated as espresso. All three reviewers praised this espresso for its clean, citrusy/orangy sweetness: “orange hard candy” for co-taster Jen Apodaca (94); orange and brown sugar for John DiRuocco (93); tart but juicy blood orange for Ken (93). All found notes that rounded and complicated the citrus: the brown sugar for John, caramel for Ken, Concord grape for Jen. Jen was most enthusiastic and explicit about what this coffee brought to three parts milk: “tasted like cherry pie.”", "notes": "Produced by Jose Francisco Aguilar Sanchez from trees of the Red and Yellow Caturra varieties of Arabica. Processed by the black honey method. With all honey processing methods, some sweet pulp or fruit flesh (“honey”) is allowed to adhere to the beans during drying. In the case of red and black honey, all of the fruit flesh is allowed to dry on the beans, but in the black honey variation, the beans are subjected to a slower drying procedure than is the case with red. This coffee tied for the top rating in a tasting of single-origin espressos from the Americas for Coffee Review ‘s November 2016 tasting report. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft roasted. Truly delicious. Socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": "A nicely balanced version of the new American style of espresso: bright but not too bright, naturally sweet, citrusy but roundly and ripely so.", "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "West Valley, Costa Rica", "Roast Level:": "Medium-Light", "Agtron:": "56/76", "Est. Price:": "$15.99/12 ounces", "Review Date:": "November 2016", "Aroma:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "With Milk:": "9", "url": "https://www.coffeereview.com/review/costa-rica-signature-reserve-don-pepe/"}, {"rating": "96", "roaster": "Coava Coffee Roasters", "title": "Mr. David Mburu Kenya", "blind assessment": "Deeply pungent, richly sweet-savory. Pink grapefruit zest, cashew, red currant, butterscotch, fine musk in aroma and cup. Intense, crisp but juicy acidity; delicate, silky-smooth mouthfeel. The finish consolidates around floral-toned musk notes in the short while an attractive new element, coconut, emerges in the long.", "notes": "This exceptional coffee was selected as the No. 6 coffee on Coffee Review’s list of the Top 30 Coffees of 2016. Produced by David Mburu Mwangi at his farm in Kenya’s Kiambu East District. Despite challenges ranging from unclear government coffee policy and urban encroachment on prime coffee lands to chronically unstable weather, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world’s most elegant and distinctive coffees. Coava is a Portland-based coffee roaster that aims to provide quality coffee and education regarding the preparation of good coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": "A complex Kenya with a bold, confident structure and an exotic combination of flavor notes; a particularly compelling choice for afternoon rejuvenation.", "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Kiambu County, south-central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "56/78", "Est. Price:": "$15.00/250 grams", "Review Date:": "October 2016", "Aroma:": "10", "Acidity:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/mr-david-mburu-kenya/"}, {"rating": "96", "roaster": "Hula Daddy", "title": "Laura’s Reserve SL-28", "blind assessment": "Lush, sweetly savory, deeply floral. Black currant, hops, coriander, kola syrup, violet in aroma and cup. Juicy, round acidity; full, syrupy mouthfeel. The flavor-saturated finish consolidates around fruit and floral tones in the short, modulating to crisp, resonant notes of hops and kola in the long.", "notes": "This outstanding coffee was selected as the No. 3 coffee on Coffee Review’s list of the Top 30 Coffees of 2016. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced entirely from trees of the distinguished SL-28 variety of Arabica, one of the two Bourbon-derived tree varieties responsible for Kenya’s finest coffees. This SL-28 was grown at the higher elevation Hula Daddy farm. It is a limited edition coffee only available for sale through the allocation list on the Hula Daddy website. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "A stellar representation of the much-admired SL-28 coffee variety—crisp yet lush, powerful—and one of our highest-rated coffees this year.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "56/82", "Est. Price:": "$44.95/8 ounces", "Review Date:": "October 2016", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "10", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/lauras-reserve-sl-28-3/"}, {"rating": "95", "roaster": "Coava Coffee Roasters", "title": "Meaza Ethiopia", "blind assessment": "Complexly layered with great sweetness. Ginger flower, mangosteen, frankincense, lemon zest, roasted cacao nib in aroma and cup. Vibrant, intricate acidity; lightly satiny mouthfeel. The rich, resonant finish is carried by rich, cocoa-toned florals and deep, sweet fruit notes.", "notes": "From the Kochere Cooperative in Yirgacheffe, a coffee region in southern Ethiopia known for its distinctive coffees produced from traditional varieties of Arabica long grown in the region. Yirgacheffe coffees like this one, processed by the wet or washed method (fruit skin and pulp are removed before drying), typically express great aromatic complexity and intensity. Coava is a Portland-based coffee roaster that aims to provide quality coffee and education regarding the preparation of good coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": "A beautifully balanced and complete wet-processed Yirgacheffe cup, lyrical in structure and sweetly inviting from aroma to finish.", "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Borena Zone, Yirgacheffe growing region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "54/74", "Est. Price:": "$15.00/250 grams", "Review Date:": "October 2016", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/meaza-ethiopia/"}, {"rating": "93", "roaster": "Magnolia Coffee", "title": "Signature Reserve Don Pepe", "blind assessment": "Rich, sweetly spicy. Black cherry, spice box, tamarind, oak, lantana-like flowers in aroma and cup. Juicy, lively acidity; syrupy mouthfeel. The sweet, resonant finish centers around deep black cherry in the short complicated by spicy oak and sweet-tart tamarind in the long.", "notes": "Produced by Jose Francisco Aguilar Sanchez from trees of the Red and Yellow Caturra varieties of Arabica. Processed the black honey method. With all honey processing methods, some sweet pulp or fruit flesh (“honey”) is allowed to adhere to the beans during drying. In the black honey variation, the beans are subjected to a slower drying procedure than is the case with yellow or red honey. This coffee tied for the second-highest rating in a cupping of Costa Rica coffees for Coffee Review ‘s October 2016 tasting report. Magnolia Coffee is a Charlotte, North Carolina-based specialty roaster whose motto is “Craft roasted. Truly delicious. Socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": "An original cup: spicy, sweetly tart, balanced.", "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "West Valley, Costa Rica", "Roast Level:": "Medium-Light", "Agtron:": "56/76", "Est. Price:": "$13.99/12 ounces", "Review Date:": "October 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/signature-reserve-don-pepe/"}, {"rating": "93", "roaster": "Greater Goods Coffee Roasters", "title": "Colombia Solarte", "blind assessment": "Delicately rich, deeply sweet. Toffee, mulberry, cedar, roasted cacao nib, rhododendron-like flowers in aroma and cup. Balanced, sweet-tart acidity; plush, buoyantly creamy mouthfeel. The crisply cocoa-toned finish is redolent of almond and rhododendron.", "notes": "Produced by Don Uriel Solarte, this coffee took sixth place out of 500 coffees in the 2016 Best of Cauca competition organized by Banexport and Cafe Imports. Greater Goods was founded in 2015; its mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and a commitment to the consistency of the specialty coffee the company roasts as well as to the local causes supported by its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "A refined, balanced, sweetly tart Colombia cup, animated by cocoa notes throughout.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Valle del Cauca Department, southwestern Colombia", "Roast Level:": "Medium-Light", "Agtron:": "60/77", "Est. Price:": "$16.00/12 ounces", "Review Date:": "September 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/colombia-solarte/"}, {"rating": "93", "roaster": "Oceana Coffee", "title": "Ethiopia Hambela Natural", "blind assessment": "Delicate, fruit-forward, deeply sweet. Blueberry, rhododendron, sandalwood, blood orange zest, roasted cacao nib in aroma and cup. Sweet, lightly juicy mouthfeel; full, satiny mouthfeel. The gently drying finish consolidates to a cocoa-toned sandalwood.", "notes": "Southern Ethiopia produces distinctive coffees from traditional heirloom varieties of Arabica long grown in the region. This is a “natural” or dry-processed version, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Established in 2009 by Amy and Scott Angelo, Oceana brews specialty coffees that have been roasted in small batches at its roasting house and café in Tequesta, Florida. Oceana’s staff is obsessed with every detail of the process, from sourcing the beans to how the coffee is poured, aimed at insuring that every cup is as rich and resonant as it should be. Visit www.oceanacoffee.com for more information.", "bottom line": "An intricate, delicately composed natural-processed Ethiopia, rife with berry and exotic aromatic wood notes.", "Roaster Location:": "Tequesta, Florida", "Coffee Origin:": "Hambela Wamena District, Guji Zone, Oromia region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "56/74", "Est. Price:": "$16.00/12 ounces", "Review Date:": "September 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-hambela-natural-6/"}, {"rating": "94", "roaster": "Greater Goods Coffee Roasters", "title": "Kenya Karatu", "blind assessment": "Complex, engaging, sweetly tart. Toffee, tamarind, violet, black truffle, dark chocolate in aroma and cup. Brisk, floral acidity; fudgy mouthfeel. Toffee notes, this coffee’s throughline, are accompanied by tamarind in the resonant short and dark chocolate in the sweet, crisp long.", "notes": "Produced from trees of the Bourbon-derived SL28 and SL34 varieties of Arabica. Grown by farmers of the Gitwe cooperative, which operates two wet mills, Karatu and Kariuga, and is composed of 1,868 farmer-members. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Greater Goods was founded in 2015; its mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and a commitment to the consistency of the specialty coffee the company roasts as well as to the local causes supported by its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "A compelling confluence of sweet, tart and floral notes, with a hint of umami intrigue in both the aroma and cup.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Thika growing region, central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "57/78", "Est. Price:": "$18.00/12 ounces", "Review Date:": "September 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/kenya-karatu/"}, {"rating": "93", "roaster": "Equator Coffees & Teas", "title": "Costa Rica El Aguacate White Honey", "blind assessment": "Crisply sweet, complex. Vanilla, grapefruit zest, roasted cacao nib, jasmine, pomegranate in aroma and cup. Zesty, sweet-tart acidity; honey-like mouthfeel. The richly drying finish is brisk with notes of pomegranate and grapefruit zest in the short, rounding to cacao nib in the long.", "notes": "Produced by Alejandro Solís Blanco at El Aguacate farm and processed by the white honey method. With all honey processing methods, some sweet pulp or fruit flesh (“honey”) is allowed to adhere to the beans during drying. In the white honey variation, an extremely thin layer of pulp is allowed to dry on the beans, less than with yellow honey, and much less than is the case with red or black honey. This coffee tied for the top rating in a cupping of honey-processed coffees for Coffee Review ’s August 2016 tasting report. Founded in 1995, Equator Coffees & Teas is a women-owned wholesale coffee roasting company that focuses on sustainability in coffee-sourcing and business practices. Visit www.equatorcoffees.com or call 800-809-7687 for more information.", "bottom line": "A tartly sweet, crisp honey-processed cup with exotic floral undertones.", "Roaster Location:": "San Rafael, California", "Coffee Origin:": "Tarrazu growing region, Costa Rica", "Roast Level:": "Medium", "Agtron:": "52/69", "Est. Price:": "$21.00/12 ounces", "Review Date:": "August 2016", "Aroma:": "9", "Acidity:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/costa-rica-el-aguacate-white-honey/"}, {"rating": "91", "roaster": "Magnolia Coffee", "title": "Costa Rica Esnider Rodriguez Red Honey", "blind assessment": "Subtly sweet, rich-toned. Hazelnut butter, blood orange, cherry blossom, fresh-cut fir, carob in aroma and cup. Rounded, sweetly tart acidity; satiny mouthfeel. The resonant, gently drying finish is saturated with blood orange and hazelnut supported by aromatic wood notes.", "notes": "Rodriguez at Los Mantiales Farm and processed by the red honey method. With all honey processing methods, some sweet pulp or fruit flesh (“honey”) is allowed to adhere to the beans during drying. In the red honey variation, all or most of the pulp is allowed to dry on the beans, rather than only a portion of it, as would be the case with yellow honey. This coffee tied for the second-highest rating in a cupping of honey-processed coffees for Coffee Review ‘s August 2016 tasting report. Magnolia Coffee is a Charlotte, North Carolina based boutique roaster whose motto is “Artisan roasted, truly delicious, socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": "A crisply rich, richly nut-toned honey cup, complicated by elegant floral notes.", "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Naranjo, West Valley, Costa Rica", "Roast Level:": "Medium-Light", "Agtron:": "53/79", "Est. Price:": "$13.99/12 ounces", "Review Date:": "August 2016", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/costa-rica-esnider-rodriguez-red-honey/"}, {"rating": "94", "roaster": "Oceana Coffee", "title": "Passport Collection Kenya Ichamara", "blind assessment": "Richly sweet-savory, intricate. Sweet chocolate, juniper, red currant, a violet-like floral top note in aroma and cup. Resonant, low-toned acidity; full, syrupy mouthfeel. The juniper note is crisply bright and almost gin-like in the finish, though cushioned by sweet chocolate and a continued shimmer of violet.", "notes": "This exceptional coffee was selected as the No. 17 coffee on Coffee Review’s list of the Top 30 Coffees of 2016. Certified organic. Produced exclusively from trees of Kenya’s two premier varieties of Arabica, the great Bourbon-related SL28 and SL34. Despite grower discontent and urban encroachment on prime coffee lands, Kenya continues to produce some of the world’s most elegant and distinctive coffees. Established in 2009 by Amy and Scott Angelo, Oceana brews specialty coffees that have been roasted in small batches at its roasting house and café in Tequesta, Florida. Oceana's staff is obsessed with every detail of the process, from sourcing the beans to how the coffee is poured, in order to ensure that every cup is as rich and resonant as it should be. Visit www.oceanacoffee.com for more information.", "bottom line": "The usual paradox of great Kenyas is embodied here by a chocolaty sweetness working against a lively, juniper-like pungency, though the usual tart berry and subtle flowers contribute too. An exceptional and original Kenya.", "Roaster Location:": "Tequesta, Florida", "Coffee Origin:": "Nyeri growing region, south-central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "54/73", "Est. Price:": "$16.00/12 ounces", "Review Date:": "July 2016", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/passport-collection-kenya-ichamara/"}, {"rating": "92", "roaster": "Oceana Coffee", "title": "Ethiopia Yirgacheffe Aricha", "blind assessment": "Deeply sweet, fruit-forward. Ripe blueberry, cocoa, jasmine, myrrh, hazelnut butter in aroma and cup. Gentle but lively acidity; full, satiny mouthfeel. The lightly resonant finish consolidates around a cocoa-toned hazelnut.", "notes": "Most Yirgacheffe coffee is prepared by the conventional wet method, in which the skin and pulp are removed from the beans or seeds before they are dried, encouraging a cleanly high-toned, often intensely floral- and citrus-toned cup. This Yirgacheffe is a “natural” or dry-processed version, however, meaning the beans/seeds were dried inside the fruit, encouraging a deeper-toned floral and fruit character. Like virtually all Ethiopia coffees, this striking and unusual coffee is produced by villagers on small, garden plots interplanted with food and other subsistence crops. Established in 2009 by Amy and Scott Angelo, Oceana brews specialty coffees that have been roasted in small batches at its roasting house and café in Tequesta, Florida. Oceana's staff is obsessed with every detail of the process, from sourcing the beans to how the coffee is poured, in order to ensure that every cup is as rich and resonant as it should be. Visit www.oceanacoffee.com for more information.", "bottom line": "A delicate, berry-driven natural-process Ethiopia with rounding cocoa and nut influences.", "Roaster Location:": "Tequesta, Florida", "Coffee Origin:": "Yirgacheffe growing region, southern Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "56/80", "Est. Price:": "$16.00/12 ounces", "Review Date:": "July 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-aricha-2/"}, {"rating": "94", "roaster": "Oceana Coffee", "title": "Ethiopia Limu Natural No. 701", "blind assessment": "Big, deep, sumptuous. Intricate flowers (lavender, wisteria), lushly complex fruit, roasted cacao nib, fragrant sandalwood in aroma and cup. Round but crisp acidity; lightly syrupy, buoyant mouthfeel. The massive flavor-saturated finish fades slightly as the cup cools.", "notes": "Limu is a growing district in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the area. This is a “natural” or dry-processed version, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or “washed” coffees. Established in 2009 by Amy and Scott Angelo, Oceana brews specialty coffees that have been roasted in small batches at its roasting house and café in Tequesta, Florida. Oceana's staff is obsessed with every detail of the process, from sourcing the beans to how the coffee is poured, in order to ensure that every cup is as rich and resonant as it should be. Visit www.oceanacoffee.com for more information.", "bottom line": "A voluptuary’s cup, lavish with layered fruit, flower and fragrant wood notes.", "Roaster Location:": "Tequesta, Florida", "Coffee Origin:": "Limu Woreda, southwest Ethiopia", "Roast Level:": "Medium-Light", "Agtron:": "57/80", "Est. Price:": "$16.50/12 ounces", "Review Date:": "July 2016", "Aroma:": "10", "Acidity:": "8", "Body:": "8", "Flavor:": "10", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-limu-natural-no-701/"}, {"rating": "91", "roaster": "Magnolia Coffee", "title": "Reserve Ethiopia Halo Bariti Coop", "blind assessment": "Sweetly rich, fruit-toned. Ripe blueberry, blood orange zest, jasmine, cedar, roasted cacao nib in aroma and cup. Quiet, bittersweet acidity; lightly syrupy mouthfeel. The resonant finish consolidates around roasted cacao nib and aromatic wood notes in the short; blood orange zest reappears in the long.", "notes": "Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. This is a “natural” or dry-processed version, meaning the beans were dried inside the fruit, encouraging a flavor profile that is rounder and lower-toned than the more familiar wet-processed floral- and citrus-toned Yirgacheffe profile. Produced by the Halo Bariti Cooperative, founded in 2012. Magnolia Coffee is a Charlotte, North Carolina based boutique roaster whose motto is “Artisan roasted, truly delicious, socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": "Cedar and roasted cacao nib envelope this fruit-forward, zesty cup.", "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Yirgacheffe growing region, south-central Ethiopia", "Roast Level:": "Light", "Agtron:": "68/98", "Est. Price:": "$13.99/12 ounces", "Review Date:": "May 2016", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/reserve-ethiopia-halo-bariti-coop/"}, {"rating": "90", "roaster": "Grounds for Change", "title": "Uganda Kayurumba", "blind assessment": "Quietly pungent, sweetly and gently roasty. Baked apple, singed oak, dark chocolate, a hint of orange blossom in aroma and cup. Mild, gentle acidity; syrupy mouthfeel. The crisp finish consolidates around apple and singed oak in the short and dark chocolate in the long.", "notes": "This coffee is organic and Fair Trade certified, the latter meaning it was purchased from small-holding farmers at a “fair” or economically sustainable price. This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Grounds for Change is a certified organic coffee roaster specializing in sustainable coffee and supporting a wide range of progressive ecological and social programs. The complete carbon footprint (from crop to cup) for this coffee has been offset with tree planting (carbonfund.org). Visit www.groundsforchange.com or call 800-796-6820 for more information.", "bottom line": "A sweetly roast-toned coffee with crisp fruit notes and an intimation of flowers.", "Roaster Location:": "Poulsbo, Washington", "Coffee Origin:": "Rwenzururu Kingdom, western Uganda", "Roast Level:": "Medium", "Agtron:": "48/56", "Est. Price:": "$11.35/12 ounces", "Review Date:": "May 2016", "Aroma:": "8", "Acidity:": "7", "Body:": "9", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/uganda-kayurumba/"}, {"rating": "94", "roaster": "Hula Daddy", "title": "Laura’s Reserve SL-28", "blind assessment": "Delicate, sweetly intricate. Honey, roasted cacao nib, raspberry, sandalwood, cinnamon in aroma and cup. Round, juicy, balanced acidity; buoyant, velvety-smooth mouthfeel. The richly drying, long finish consolidates to pretty cinnamon and cocoa notes.", "notes": "Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced entirely from trees of the distinguished SL-28 variety of Arabica, one of the two Bourbon-derived tree varieties responsible for Kenya’s finest coffees. This SL-28 was grown at the higher elevation Hula Daddy farm. It is a limited edition coffee available for sale only by telephone or in person at the farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "The elegantly lush yet crisply pungent paradox of the SL-28 profile is expressed here with a particularly juicy, layered balance.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "58/83", "Est. Price:": "$39.95/8 ounces", "Review Date:": "May 2016", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/lauras-reserve-sl-28-2/"}, {"rating": "91", "roaster": "Greater Goods Coffee Roasters", "title": "Papua New Guinea Korona", "blind assessment": "Delicate, complex, sweetly pungent. Lemongrass, jasmine, caramel, frankincense, apricot in aroma and cup. Crisp, lightly juicy acidity; silky, slightly grainy mouthfeel. The richly drying finish consolidates around apricot and lemongrass.", "notes": "Produced by the Kahento family from trees of the Typica and Arusha varieties of Arabica. The high mountain valleys of central Papua New Guinea offer some of the world’s most favorable terroirs for production of fine coffee, although the rugged terrain presents daunting transportation and infrastructure challenges. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts and to the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "A crisply sweet coffee driven by stone fruit and bright herb notes.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Eastern Highlands, Papua New Guinea", "Roast Level:": "Medium-Light", "Agtron:": "62/78", "Est. Price:": "$13.00/12 ounces", "Review Date:": "April 2016", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/greater-goods-coffee-roasters/"}, {"rating": "93", "roaster": "Hula Daddy", "title": "100% Kona High Mountain Io Fancy", "blind assessment": "The classic Kona cup on steroids, maybe with a hint of Kenya: sweetly and pungently berry-toned; chocolatey and floral.", "notes": "Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": "The classic Kona cup on steroids, maybe with a hint of Kenya: sweetly and pungently berry-toned; chocolatey and floral.", "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "56/82", "Est. Price:": "$32.95/8 ounces", "Review Date:": "April 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/100-kona-high-mountain-io-fancy/"}, {"rating": "92", "roaster": "Greater Goods Coffee Roasters", "title": "Fresh Perspective Ethiopian", "blind assessment": "Richly and ripely fruit-toned. Tartly juicy raspberry, sandalwood, roasted cacao nib, lavender in aroma and cup. Crisp, lively acidity; dry, satiny mouthfeel. Lavender and roasted cacao nib carry into a crisply floral-toned finish.", "notes": "Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. Most Yirgacheffe coffee is prepared by the conventional wet method, in which the skin and pulp are removed from the beans or seeds before they are dried, encouraging a cleanly high-toned, often intensely floral- and citrus-toned cup. This Yirgacheffe is a “natural” or dry-processed version, however, meaning the beans/seeds were dried inside the fruit, encouraging a deeper-toned profile, more pungent than bright, though still extravagant in its aromatics. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts and to the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": "An unusual dried-in-the-fruit or “natural” profile: ripely juicy yet crisply dry and lavender-toned.", "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Yirgacheffe growing region, southern Ethiopia", "Roast Level:": "Light", "Agtron:": "60/86", "Est. Price:": "$14.50/12 ounces", "Review Date:": "March 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/fresh-perspective-ethiopian/"}, {"rating": "94", "roaster": "Hula Daddy", "title": "100% Kona Bourbon Pointu Laurina", "blind assessment": "Deeply rich, subtly complex. Honey, prickly pear fruit, clove, cocoa nib and jasmine in aroma and cup. Delicate, dynamically composed acidity; buttery-smooth mouthfeel. The resonant, spice-toned finish leads with cocoa butter in the short and clove notes in the long.", "notes": "Bourbon Pointu, botanical name var. Laurina, is a rare variety of arabica that is a natural mutation of the famous Bourbon variety from Reunion Island in the Indian Ocean. The Bourbon Pointu is famous for its natural low levels of caffeine, bean shape (small and tending to be pointed at the ends, hence “pointu”), and pungently fruit-toned, Bourbon-like cup. This version was produced in Kona, Hawaii. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "56/78", "Est. Price:": "$34.95/8 ounces", "Review Date:": "February 2016", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/100-kona-bourbon-pointu-laurina/"}, {"rating": "89", "roaster": "Grounds for Change", "title": "Peru Cafe Femenino", "blind assessment": "Roast-toned and chocolaty. Roasted almond, dark chocolate, narcissus, molasses in aroma and cup. Crisply dry acidity; velvety mouthfeel. Chocolate and nut suggestions consolidate in a gently drying finish.", "notes": "This coffee is organic and Fair Trade certified, the latter meaning it was purchased from small-holding farmers at a “fair” or economically sustainable price. Cafe Femenino is an organization that supports women farmers and their families in coffee growing communities. This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Grounds for Change is a certified organic coffee roaster specializing in sustainable coffee and supporting a wide range of progressive ecological and social programs. The complete carbon footprint (from crop to cup) for this coffee has been offset with tree planting (carbonfund.org). Visit www.groundsforchange.com or call 800-796-6820 for more information.", "bottom line": null, "Roaster Location:": "Poulsbo, Washington", "Coffee Origin:": "Lambayeque region, Peru", "Roast Level:": "Medium-Dark", "Agtron:": "46/52", "Est. Price:": "$10.95/12 ounces", "Review Date:": "February 2016", "Aroma:": "8", "Acidity:": "7", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/peru-cafe-femenino-2/"}, {"rating": "93", "roaster": "San Francisco Bay Coffee", "title": "Panama Geisha", "blind assessment": "Roast-toned and floral. Singed oak, pomegranate, lavender, baker’s chocolate in aroma and cup. Quiet, juicy acidity; plump, syrupy mouthfeel. Hints of lavender and cocoa in the gently drying finish.", "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also spelled Geisha). With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world’s most unique coffees. This is a wet-processed or “washed” version, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. San Francisco Bay is one of five coffee brands produced by the family-owned Rogers Family Company. Visit www.sfbaycoffee.com or call 800-829-1300 for more information.", "bottom line": null, "Roaster Location:": "Lincoln, California", "Coffee Origin:": "Boquete growing region, western Panama", "Roast Level:": "Medium", "Agtron:": "42/64", "Est. Price:": "$29.99/12 ounces", "Review Date:": "January 2016", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/panama-geisha/"}, {"rating": "94", "roaster": "Turnstile Coffee Roasters", "title": "Kenya Nyeri Thageini", "blind assessment": "Rich and deeply sweet. Honey, lavender, Concord grape, roasted cacao nib, myrrh in aroma and cup. Juicy, lyrical acidity; plump, satiny mouthfeel. Flavor, particularly grape and cacao nib, consolidate in a richly drying finish.", "notes": "Despite challenges ranging from unclear government coffee policy and urban encroachment on prime coffee lands to chronically unstable weather, the famed Kenya coffee auction system and its participating cooperatives continue to produce some of the world’s most elegant and distinctive coffees. Turnstile Coffee Roasters brings the city coffee experience to the Jersey Shore in Belmar, New Jersey. Visit www.turnstilecoffee.com or call 732-894-9012 for more information.", "bottom line": null, "Roaster Location:": "Belmar, New Jersey", "Coffee Origin:": "South-central Kenya", "Roast Level:": "Medium-Light", "Agtron:": "54/68", "Est. Price:": "$18.00/12 ounces", "Review Date:": "December 2015", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kenya-nyeri-thageini/"}, {"rating": "93", "roaster": "Hula Daddy", "title": "Hokulele Kona", "blind assessment": "Sweet, floral-toned pungency. Vanilla, macadamia nut, fresh peach and rose hips in aroma and cup. Vibrant and balanced acidity; silky mouthfeel. The richly drying finish is carried by peach notes in the short and rose hips in the long.", "notes": "This is an unusual dry-processed or “natural” Kona, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with the wet-processed or “washed” process more typical for Konas. It also consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holulaloa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "54/76", "Est. Price:": "$39.95/8 ounces", "Review Date:": "December 2015", "Aroma:": "9", "Acidity:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/hokulele-kona/"}, {"rating": "90", "roaster": "San Francisco Bay Coffee", "title": "Sumatra Mandheling", "blind assessment": "Intensely and sweetly roasty. Baker’s chocolate, scorched cedar, hints of apple and grapefruit in aroma and cup. Lightly syrupy, plump mouthfeel. The finish is drying but richly chocolate-toned.", "notes": "Coffees from the northern part of the Indonesian island of Sumatra are valued for their complex earth and fruit notes that appear to result largely from unorthodox fruit removal and drying practices called “wet hulling.” San Francisco Bay is one of five coffee brands produced by the family-owned Rogers Family Company. Visit www.sfbaycoffee.com or call 800-829-1300 for more information.", "bottom line": null, "Roaster Location:": "Lincoln, California", "Coffee Origin:": "Mandheling growing region, northern Sumatra, Indonesia", "Roast Level:": "Medium-Dark", "Agtron:": "37/45", "Est. Price:": "$14.99/12 ounces", "Review Date:": "December 2015", "Aroma:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/sumatra-mandheling-21/"}, {"rating": "91", "roaster": "Grounds for Change", "title": "Ethiopia Yirgacheffe", "blind assessment": "Quietly rich, savory-sweet. Blood orange, sandalwood, lily-like flowers, roasted cacao nib in aroma and cup. Sweetly and roundly tart acidity; satiny mouthfeel. Flavor saturates a gently bittersweet finish.", "notes": "Certified organically grown and “Fair for Life” certified by the Institute for Market-Ecology (IMO), a different certifying body from the more familiar Fair Trade USA and its certification, deploying parallel but somewhat different criteria and methods. This coffee was produced by the Oromia Cooperative, established in 1999 and currently representing 288,000 household farmers. Southern Ethiopia coffees like this one are produced from traditional Ethiopian varieties of Arabica long grown in the region. It was processed by the wet or washed method (fruit skin and pulp are removed before drying). Ethiopia coffees processed by this method typically express great aromatic complexity and intensity, with a particular emphasis on floral notes. Grounds for Change is a certified organic coffee roaster specializing in sustainable coffee and supporting a wide range of progressive ecological and social programs. The complete carbon footprint (from crop to cup) for this coffee has been offset with tree planting (carbonfund.org). Visit www.groundsforchange.com or call 800-796-6820 for more information.", "bottom line": null, "Roaster Location:": "Poulsbo, Washington", "Coffee Origin:": "Yirgacheffe growing region, southern Ethiopia", "Roast Level:": "Medium", "Agtron:": "51/61", "Est. Price:": "$11.75/12 ounces", "Review Date:": "November 2015", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-22/"}, {"rating": "91", "roaster": "Grounds for Change", "title": "Guatemala Huehuetenango", "blind assessment": "Deep, rich. Oak, molasses, dark chocolate, orange zest, pecan in aroma and cup. Round, quiet acidity; plush mouthfeel. Dark chocolate and pecan in particular carry into a sweet, balanced finish.", "notes": "Certified organically grown and “Fair for Life” certified by the Institute for Market-Ecology (IMO), a different certifying body from the more familiar Fair Trade USA and its certification, but deploying parallel though somewhat different criteria and methods. Huehuetenango is a particularly admired Guatemala growing region. This is a wet-processed or “washed” coffee, meaning the fruit skin and pulp were removed from the beans immediately after harvesting and before drying. Grounds for Change is a certified organic coffee roaster specializing in sustainable coffee and supporting a wide range of progressive ecological and social programs. The complete carbon footprint (from crop to cup) for this coffee has been offset with tree planting (carbonfund.org). Visit www.groundsforchange.com or call 800-796-6820 for more information.", "bottom line": null, "Roaster Location:": "Poulsbo, Washington", "Coffee Origin:": "Huehuetenango growing region, Guatemala", "Roast Level:": "Medium", "Agtron:": "51/61", "Est. Price:": "$11.35/12 ounces", "Review Date:": "November 2015", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/guatemala-huehuetenango-9/"}, {"rating": "88", "roaster": "Magnolia Coffee", "title": "Honduras Finca Gaby", "blind assessment": "Deeply sweet, savory-edged, perfumy. Cocoa powder, rose-like flowers, almond, a hint of brie cheese in aroma and cup. Roast-rounded acidity; plush though very slightly roughish mouthfeel. The cocoa note in particular persists in a savory-sweet finish.", "notes": "This is a certified organically grown and Fair Trade Certified green coffee, meaning it was purchased from small-holding farmers at a “fair” or economically sustainable price. However, this roasted, retail version does not carry the Fair Trade USA seal on the bag or website because, although the producer and importer are Fair Trade Certified, the roaster is not. Produced by Norma Mileybi Lara of Finca Gaby, a member of COCAFELOL, a collective of more than 300 farmers growing organic arabica coffee in the biological reserve of El Guisayote in Ocotepeque Department near the border with Guatemala. Magnolia Coffee is a Charlotte, North Carolina based boutique roaster whose motto is “Artisan roasted, truly delicious, socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": null, "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Ocotepeque Department, Honduras", "Roast Level:": "Medium", "Agtron:": "50/64", "Est. Price:": "$12.99/12 ounces", "Review Date:": "November 2015", "Aroma:": "7", "Acidity:": "7", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/honduras-finca-gaby/"}, {"rating": "91", "roaster": "Greater Goods Coffee Roasters", "title": "FTO Ethiopia Gedeb", "blind assessment": "Sweet, delicately bright. Orange blossom, apple, turbinado sugar, walnut, a hint of tangerine in aroma and cup. Lively, gently bright acidity; smooth, velvety mouthfeel. Flavor-saturated, but richly drying, and bittersweet in the finish.", "notes": "This coffee is certified organically grown and Fair Trade Certified, meaning it was purchased from small-holding farmers at a “fair” or economically sustainable price. Yirgacheffe is a coffee region in southern Ethiopia that produces distinctive coffees from traditional varieties of Arabica long grown in the region. Yirgacheffe coffees like this one processed by the wet or washed method (fruit skin and pulp are removed before drying) typically express great aromatic complexity and intensity with a particular emphasis on floral notes. This Yirgacheffe was produced by farmers in the Worka Cooperative, currently representing 305 members. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts and to the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": null, "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Gedeb District, Yirgacheffe growing region, southern Ethiopia", "Roast Level:": "Light", "Agtron:": "60/82", "Est. Price:": "$15.00/12 ounces", "Review Date:": "November 2015", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/fto-ethiopia-gedeb/"}, {"rating": "92", "roaster": "Greater Goods Coffee Roasters", "title": "Life Saver Guatemala Organic Finca Santa Rita", "blind assessment": "Deeply sweet, subtly complex. Almond, mulberry, baker’s chocolate, cedar, a hint of wisteria-like flowers in aroma and cup. Quietly and gently bright acidity; light but silky, buoyant mouthfeel. Chocolate and almond in particular carry into a resonant finish.", "notes": "A single-origin coffee sourced from the Echeverria family, which has been cultivating coffee since 1878. This shade-grown coffee is also UTZ-certified, certified organically grown and certified bird-friendly by the Smithsonian Migratory Bird Center. Greater Goods is a small-batch wholesale and retail roasting company in Austin, Texas. Founded in 2015, the Greater Goods mission is to enrich the lives of coffee-drinkers through passion, creativity, innovation and commitment to the consistency of the specialty coffee the company roasts, and through the local causes supported with its proceeds. Visit greatergoodsroasting.com or call 512-858-2680 for more information.", "bottom line": null, "Roaster Location:": "Austin, Texas", "Coffee Origin:": "Chimaltenango Department, Guatemala.", "Roast Level:": "Medium-Light", "Agtron:": "58/69", "Est. Price:": "$13.50/12 ounces", "Review Date:": "August 2015", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/life-saver-guatemala-organic-finca-santa-rita/"}, {"rating": "93", "roaster": "Turnstile Coffee Roasters", "title": "Kenya Gakui Peaberry", "blind assessment": "Exuberantly floral and berry-toned. Mulberry, lantana-like flowers, roasted cacao nib, hints of ripe lemon and black sage in aroma and cup. Delicate, lively acidity; plush mouthfeel. Flavor quiets but lasts in a round, resonant finish.", "notes": "The Gakui wet mill is part of the Gakundu Farmers Cooperative Society, which consists of four wet mills in total. Produced from trees of the admired heirloom SL28 and SL34 varieties of Arabica, as well as the hybrid Ruiru 11. This sample consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Turnstile Coffee Roasters brings the city coffee experience to the Jersey Shore in Belmar, New Jersey. Visit www.turnstilecoffee.com or call 732-894-9012 for more information.", "bottom line": null, "Roaster Location:": "Belmar, New Jersey", "Coffee Origin:": "Gakui, Central Kenya.", "Roast Level:": "Medium", "Agtron:": "51/65", "Est. Price:": "$18.50/12 ounces", "Review Date:": "February 2015", "Aroma:": "9", "Acidity:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kenya-gakui-peaberry/"}, {"rating": "89", "roaster": "San Francisco Bay Coffee", "title": "Reserve 100% Panama Geisha", "blind assessment": "Deep, richly roasty, chocolate- and fruit-toned. Lightly scorched cedar, dark chocolate, musk, apricot in aroma and cup. Sweet, roast-rounded acidity; lightly plush mouthfeel. The finish is dry and roast-toned with a backgrounded chocolaty sweetness.", "notes": "Produced from trees of the rare Ethiopia-derived botanical variety Gesha (also spelled Geisha). With its generally elongated beans and distinctive floral and crisp, often chocolaty cup, the Gesha variety continues to distinguish itself as one of the world’s most unique coffees. This coffee was produced on Finca Santa Barbara, named after Barbara Rogers, Vice-President of the Rogers Family Company. San Francisco Bay is one of five coffee brands produced by the family-owned Rogers Family Company. Visit www.sfbaycoffee.com or call 800-829-1300 for more information.", "bottom line": null, "Roaster Location:": "Lincoln, California", "Coffee Origin:": "Boquete growing region, western Panama.", "Roast Level:": "Dark", "Agtron:": "36/44", "Est. Price:": "$29.99/12 ounces", "Review Date:": "March 2015", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/reserve-100-panama-geisha/"}, {"rating": "92", "roaster": "Magnolia Coffee", "title": "Ethiopia Yirgacheffe Konga", "blind assessment": "Crisp, quietly juicy. Orange, roasted cacao nib, caramel, wisteria-like flowers, a brisk hint of peppermint in aroma and cup. Gently bright, fruit-toned acidity; satiny mouthfeel. Flavor, particularly an orangy chocolate, saturates a richly drying finish.", "notes": "Yirgacheffe is a coffee region in southern Ethiopia that produces distinctively floral- and fruit-toned coffees from traditional varieties of Arabica long grown in the region. This is a “natural” or dry-processed Yirgacheffe, meaning the beans were dried inside the fruit, encouraging a flavor profile that is lower-toned and more pungent than the more familiar wet-processed Yirgacheffe floral- and citrus-toned profile. Magnolia Coffee is a Charlotte, North Carolina based boutique roaster whose motto is “Artisan roasted, truly delicious, socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": null, "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Konga District, Yirgacheffe growing region, southern Ethiopia.", "Roast Level:": "Medium-Light", "Agtron:": "60/78", "Est. Price:": "$12.99/12 ounces", "Review Date:": "January 2015", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-konga-2/"}, {"rating": "94", "roaster": "Hula Daddy", "title": "Laura’s Reserve SL-28", "blind assessment": "Big, juicy, resonantly bright. Blood orange, black currant, lilac, vanilla, dark chocolate. Rich, round, lively acidity; full, syrupy mouthfeel. Flavor consolidates but retains depth and sweetness in a long finish.", "notes": "Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced entirely from trees of the distinguished SL-28 variety of Arabica, one of the two Bourbon-derived tree varieties responsible for Kenya’s finest coffees. This SL-28 was grown at the higher elevation Hula Daddy farm. It is a limited edition coffee available for sale only by telephone or in person at the farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii.", "Roast Level:": "Medium", "Agtron:": "53/68", "Est. Price:": "$35.95/8 ounces", "Review Date:": "December 2014", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/lauras-reserve-sl-28/"}, {"rating": "95", "roaster": "Hula Daddy", "title": "High Mountain Red Bourbon", "blind assessment": "Roundly bright, juicy, complex. Orange, mulberry, vanilla, honey, complex night-blooming flowers in aroma and cup. Giddy, buoyantly sweet acidity; plush mouthfeel. Flavor extends deep into a long finish.", "notes": "This exceptional coffee was selected as the #11 coffee on Coffee Review’s list of the Top 30 Coffees of 2014. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee, all from trees of the heirloom Red Bourbon variety, was produced at the higher elevation Hula Daddy farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii.", "Roast Level:": "Medium-Light", "Agtron:": "61/77", "Est. Price:": "$34.95/8 ounces", "Review Date:": "November 2014", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/high-mountain-red-bourbon/"}, {"rating": "92", "roaster": "Hula Daddy", "title": "High Mountain Io Fancy Light Roast", "blind assessment": "Sweetly pungent, quietly complex. Honey, tangerine, dark chocolate, hints of clove and lilac in aroma and cup. Round, backgrounded but vibrant acidity; lightly syrupy, resonant mouthfeel. Flavor consolidates around lingering hints of tangerine and clove in a sweet-toned, balanced finish.", "notes": "Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, “Big Island” of Hawaii.", "Roast Level:": "Medium-Light", "Agtron:": "59/77", "Est. Price:": "$32.95/8 ounces", "Review Date:": "August 2014", "Aroma:": "8", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/high-mountain-io-fancy-light-roast/"}, {"rating": "91", "roaster": "Magnolia Coffee", "title": "Bali Kintamani", "blind assessment": "Deep, sweet, richly fermenty. Blueberry and blackberry, dark chocolate, Bourbon whisky and carnal, sweetly heavy floral notes in aroma and cup. Round, backgrounded acidity; heavy mouthfeel. The finish is richly resonant with an edgy overripe fruit.", "notes": "Produced in the central highlands of the colorful island of Bali, this is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit has been removed, as is the case with wet-processed or \"washed\" coffees. Magnolia Coffee is a Charlotte, North Carolina based boutique roaster whose motto is “Artisan roasted, truly delicious, socially conscious.” Magnolia particularly emphasizes community engagement through its Local Beans for Local Good programs. Visit www.magnoliacoffeeco.com or call 704-651-7726 for more information.", "bottom line": null, "Roaster Location:": "Charlotte, North Carolina", "Coffee Origin:": "Central Bali, Indonesia", "Roast Level:": "Medium-Light", "Agtron:": "59/78", "Est. Price:": "$13.99/12 ounces", "Review Date:": "May 2014", "Aroma:": "9", "Acidity:": "7", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/bali-kintamani-2/"}, {"rating": "91", "roaster": "Torque Coffee Roasters", "title": "Apex Blend", "blind assessment": "Sweetly bright, gently complex. Honey, rose-like flowers, zesty orange, hints of moist pipe tobacco and walnut in aroma and cup. Buoyantly and sweetly tart acidity; silky, lively mouthfeel. Delicately dry, favor-saturated finish.", "notes": "For every bag sold of this blend three dollars is donated to the Nelson Mandela Foundation. Torque Coffee is a small-batch coffee roaster founded in Vancouver, Washington in 2011 in a renovated garage that in years since has distinguished itself through careful sourcing and focused roasting. As of 2024, based in San Diego, California. Visit www.torquecoffees.com for more information.", "bottom line": null, "Roaster Location:": "Vancouver, Washington", "Coffee Origin:": "Not disclosed.", "Roast Level:": "Medium-Light", "Agtron:": "58/83", "Est. Price:": "$14.50/12 ounces", "Review Date:": "February 2014", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/apex-blend/"}, {"rating": "94", "roaster": "Hula Daddy", "title": "100% Kona High Mountain Io Extra Fancy", "blind assessment": "Richly and sweetly tart fruit – suggesting açai perhaps – dominates in aroma and cup, supported by dark chocolate, pungent cedar and rose-like flowers. Deep, sweet-toned acidity; big, syrupy mouthfeel. Flavor rounds and consolidates in a crisply drying finish.", "notes": "This exceptional coffee was selected as the #26 coffee in the Coffee Review Top 30 Coffees of 2013. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm, and is an Extra Fancy, the highest grade of Kona coffee based on bean size and freedom from physical imperfection. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii.", "Roast Level:": "Medium-Light", "Agtron:": "55/75", "Est. Price:": "$35.95/8 ounces", "Review Date:": "October 2013", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/100-kona-high-mountain-io-extra-fancy/"}, {"rating": "93", "roaster": "Hula Daddy", "title": "100% Kona Grown Brazilian Typica", "blind assessment": "Opulent, deep. Fresh-cut cedar, dark chocolate, vanilla, ripe orange in aroma and cup. Richly bright, slightly tart acidity; full, syrupy mouthfeel. Flavor consolidates but persists in a rich, roundly drying finish.", "notes": "This coffee was produced exclusively from a strain of the Typica variety of Arabica brought to Hawaii in the 19th century, mainly from Brazil. Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was produced at the higher elevation Hula Daddy farm, and is an Extra Fancy, the highest grade of Kona coffee based on bean size and freedom from physical imperfection. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii.", "Roast Level:": "Medium", "Agtron:": "52/66", "Est. Price:": "$59.95/16 ounces", "Review Date:": "October 2013", "Aroma:": "9", "Acidity:": "8", "Body:": "9", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/100-kona-grown-brazilian-typica/"}, {"rating": "91", "roaster": "Coava Coffee Roasters", "title": "David Mancia Honduras", "blind assessment": "Sweetly tart, subtly floral. Honey, candied lemon, hints of rose-like flowers and roasted cacao nib in aroma and cup. Gently brisk acidity; lightly syrupy mouthfeel. Flavor saturates a rich, slightly drying finish.", "notes": "Produced from trees of the Pacas and Catimor varieties of Arabica on the two-hectare farm of David Mancia in the Honduran village of El Cielito at an elevation of over 5,000 feet. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": null, "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Santa Barbara Department, Honduras.", "Roast Level:": "Light", "Agtron:": "63/79", "Est. Price:": "$13.50/8.8 ounces", "Review Date:": "August 2013", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/david-mancia-honduras/"}, {"rating": "80", "roaster": "San Francisco Bay Coffee (Costco)", "title": "Organic Rainforest Blend", "blind assessment": "Heavily scorched wood dominates in aroma and cup, with hints of faded chocolate, clove and molasses. Acidity is folded inside the scorched pungency of the roast; mouthfeel is light and leanish. The finish is bittersweet and drying.", "notes": "Purchased in whole bean format at Costco in San Leandro, California for an equivalent of $5.65 per pound. This coffee is certified organically grown. San Francisco Bay is one of five coffee brands produced by the family-owned Rogers Family Company. Visit www.sfbaycoffee.com or call 800-829-1300 for more information.", "bottom line": null, "Roaster Location:": "Lincoln, California", "Coffee Origin:": "Not disclosed", "Roast Level:": "Very Dark", "Agtron:": "29/35", "Est. Price:": "$16.80/48 ounces", "Review Date:": "November 2012", "Aroma:": "6", "Body:": "6", "Flavor:": "6", "Aftertaste:": "6", "url": "https://www.coffeereview.com/review/organic-rainforest-blend/"}, {"rating": "89", "roaster": "Grounds for Change", "title": "Guatemala Quetzel", "blind assessment": "Sweet, delicately crisp. Dark chocolate, brown sugar, hints of plum and fresh-cut cedar in aroma and cup. Tartly juicy acidity; the mouthfeel is light, hinting at silkiness. Chocolate carries into a gently drying finish.", "notes": "Certified organically grown and Fair Trade or “Fair for Life” certified by the Institute for Market-Ecology (IMO), a different certifying body from the more familiar Fair Trade USA certification, deploying parallel but somewhat different criteria and methods. Grounds for Change is a certified organic coffee roaster specializing in sustainable coffee and supporting a wide range of progressive ecological and social programs. The complete carbon footprint (from crop to cup) for this coffee has been offset with tree planting (carbonfund.org). Visit www.groundsforchange.com or call 800-796-6820 for more information.", "bottom line": null, "Roaster Location:": "Poulsbo, Washington", "Coffee Origin:": "Quetzaltenango growing region, southwestern Guatemala", "Roast Level:": "Medium", "Agtron:": "50/58", "Est. Price:": "$12.95/16 ounces", "Review Date:": "October 2012", "Aroma:": "9", "Acidity:": "8", "Body:": "7", "Flavor:": "8", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/guatemala-quetzel/"}, {"rating": "93", "roaster": "Turnstile Coffee Roasters", "title": "Ethiopia Yirgacheffe Kochere Grade 1r", "blind assessment": "Richly tart berry, caramel, walnut, night flowers in aroma and cup. Richly lyric, perfectly balanced acidity. Light but impressively silky mouthfeel. Clean, rich, flavor-saturated finish.", "notes": "The Kochere District adjoins the Yirgacheffe coffee growing region in southern Ethiopia, famous for its distinctively floral- and fruit-toned coffees from traditional varieties of Arabica long grown in the region. Yirgacheffe-style coffees like this one processed by the wet or washed method (fruit skin and pulp is removed before drying) typically express great aromatic complexity and intensity with a particular emphasis on citrus and floral notes. Turnstile Coffee Roasters brings the city coffee experience to the Jersey Shore in Belmar, New Jersey. Visit www.turnstilecoffee.com or call 732-894-9012 for more information.", "bottom line": null, "Roaster Location:": "Belmar, New Jersey", "Coffee Origin:": "Kochere District, southern Ethiopia.", "Roast Level:": "Medium", "Agtron:": "49/66", "Est. Price:": "$16.00/12 ounces", "Review Date:": "July 2012", "Aroma:": "9", "Acidity:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ethiopia-yirgacheffe-kochere-grade-1r/"}, {"rating": "93", "roaster": "Hula Daddy", "title": "Laura’s Blend: 100 Percent Kona Coffee Fancy", "blind assessment": "Pleasing caramelly sweetness is balanced by hints of pungent cedar and complemented by orange and floral notes. Delicate but rich acidity; lively, silky mouthfeel. Flavor carries into a long, elegantly clean finish.", "notes": "Hula Daddy is a boutique coffee producer with farms at the 1,400 and 2,500 foot levels of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee is a blend of beans from both farms. Fancy is the second-highest grade of Kona coffee mainly based on bean size, but the exceptional character of this coffee is probably more owing to fastidious harvesting, fruit removal and drying than to size of the bean. This coffee was selected, processed and roasted under the supervision of Laura Ross, Hula Daddy’s roastmaster. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii.", "Roast Level:": "Medium", "Agtron:": "54/64", "Est. Price:": "$47.95/16 ounces", "Review Date:": "April 2012", "Aroma:": "9", "Acidity:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/lauras-blend-100-percent-kona-coffee-fancy/"}, {"rating": "90", "roaster": "Grounds for Change", "title": "Bolivia “Taipiplaya” Fair Trade Organic Certified", "blind assessment": "Delicate, fresh, balanced. Nut-toned caramel, orange, fir, a hint of flowers in aroma and cup. Gently bright, lemony acidity; smoothly silky mouthfeel. The simple but pleasing aromatics carry straight through to a long, sweet, slightly pungent finish.", "notes": "Certified organically grown and Fair Trade, meaning this coffee was purchased from small-holding farmers at a \"fair\" or economically sustainable price. Grounds for Change is a certified organic coffee roaster specializing in 100% Fair Trade Coffee. Visit www.groundsforchange.com or call 800-796-6820 for more information.", "bottom line": null, "Roaster Location:": "Poulsbo, Washington", "Coffee Origin:": "Carnavi Province, Bolivia.", "Roast Level:": "Medium", "Agtron:": "50/62", "Est. Price:": "$10.95/12 ounces", "Review Date:": "February 2012", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/bolivia-taipiplaya-fair-trade-organic-certified/"}, {"rating": "93", "roaster": "Hula Daddy", "title": "Peaberry Medium Roast", "blind assessment": "Delicate, sweetly bright, refreshing. Fresh-cut fir, almond-like nut and the pure, sweetly tart flavor of coffee fruit in aroma and cup. Softly brisk, floral-toned acidity; silky to lightly syrupy mouthfeel. A hint of cocoa that emerges in the cup quietly dominates a crisply sweet finish.", "notes": "Peaberries result when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Hula Daddy is a boutique coffee farm and mill located near the southern end of the Kona growing district. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii.", "Roast Level:": "Medium", "Agtron:": "49/64", "Est. Price:": "$44.95/16 ounces", "Review Date:": "January 2012", "Aroma:": "8", "Acidity:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/peaberry-medium-roast-2/"}, {"rating": "92", "roaster": "Coava Coffee Roasters", "title": "Guatemala Xeucalvitz Espresso", "blind assessment": "Evaluated as espresso. Complex, crisply sweet aroma deepens and turns bittersweet in the small cup: dark chocolate, pungent, mango-like fruit, orange, smoothing again in a resonant, flavor-saturated finish. Medium body, lightly syrupy mouthfeel. Flavor simplifies and fades a bit in milk, though the dark chocolate and tropical fruit character persist.", "notes": "Xeucalvitz is one of four mainly indigenous coffee producing communities that form an association called Ixil A’achimbal. The coffee is fermented without water for around twenty hours in wooden boxes covered with banana leaves, washed, and sun-dried on tables and tarps, a local variation on orthodox wet-processing, and one that seems to have a complex and positive impact on cup character. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": null, "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "El Quiche Department, south central Guatemala", "Roast Level:": "Medium", "Agtron:": "52/61", "Est. Price:": "$12.00/250 grams (8.8 oz.)", "Review Date:": "July 2011", "Aroma:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "With Milk:": "8", "url": "https://www.coffeereview.com/review/guatemala-xeucalvitz-espresso-2/"}, {"rating": "95", "roaster": "Coava Coffee Roasters", "title": "Guatemala Xeucalvitz", "blind assessment": "Very sweet, ripe lemon, rich cocoa, backgrounded lush flowers in aroma and cup. Vivacious acidity and a mouthfeel almost effervescent in its buoyancy and liveliness. Sweet, deep, flavor-saturated finish.", "notes": "Xeucalvitz is one of four coffee producing communities that form an association called Ixil A’achimbal. The coffee is fermented without water for around twenty hours in wooden boxes covered with banana leaves, washed, and sun-dried on tables and tarps, a local variation on orthodox wet-processing, and one that seems to have a complex and positive impact on cup character. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": null, "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "El Quiche Department, south central Guatemala", "Roast Level:": "Medium-Light", "Agtron:": "58/79", "Est. Price:": "$12.00/250 grams (8.8 oz.)", "Review Date:": "July 2011", "Aroma:": "9", "Acidity:": "9", "Body:": "9", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/guatemala-xeucalvitz-2/"}, {"rating": "90", "roaster": "Coava Coffee Roasters", "title": "Ixil A’achimbal Guatemala", "blind assessment": "Quietly balanced, sweetly tart: flowers and orangy citrus, a hint of cedar carry from aroma to cup. Round, soft acidity; lightly syrupy mouthfeel; the tart sweetness extends into a long finish.", "notes": "From trees of the traditional Bourbon and Typica varieties of Arabica. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": null, "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Quiche Department, Guatemala.", "Roast Level:": "Medium-Light", "Agtron:": "59/77", "Est. Price:": "$12.00/250 grams (8.8 oz.)", "Review Date:": "June 2011", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/ixil-aachimbal-guatemala/"}, {"rating": "94", "roaster": "Coava Coffee Roasters", "title": "Ibonia Kenya Peaberry", "blind assessment": "Intense and deep yet delicately balanced, saturated from aroma through finish with famous, sweetly tart Kenya black currant sensation, a layering of ripe lemon, honey, fresh-cut fir, blackberry, flowers and, depending on one’s memory bank, probably much more. Gently rich acidity, lightly silky mouthfeel. The black currant note rings on far into the finish.", "notes": "From trees of the admired, Bourbon-derived SL 28 and SL 34 varieties. Consists entirely of peaberries, a kind of bean that results when the coffee fruit develops only a single, oval bean rather than the usual pair of flat-sided beans. Peaberries produce a somewhat different (often better) cup than normal beans from the same crop, from which they may or may not be separated during grading. Coava is a Portland based coffee roaster that aims to provide quality coffee and the knowledge needed to properly brew that coffee. Visit www.coavacoffee.com or call 503-894-8134 for more information.", "bottom line": null, "Roaster Location:": "Portland, Oregon", "Coffee Origin:": "Kiambu District, Kenya.", "Roast Level:": "Medium", "Agtron:": "51/69", "Est. Price:": "$15.00/250 grams (8.8 oz)", "Review Date:": "June 2011", "Aroma:": "9", "Acidity:": "9", "Body:": "8", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/ibonia-kenya-peaberry/"}, {"rating": "94", "roaster": "Hula Daddy", "title": "Extra Fancy Kona Coffee Medium Roast", "blind assessment": "Deep, intense, pungently fruity aroma; think grapefruit. Rich, balanced acidity; lightly syrupy mouthfeel. Continued complexly sweet yet pungent fruit dominates in the cup: grapefruit, lemon, blackberry, black currant. Rich, flavor-saturated finish.", "notes": "Hula Daddy is a boutique coffee farm at the 1,400 foot level of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. Extra Fancy is the highest grade of Kona coffee mainly based on bean size, but the exceptional character of this coffee is probably more owing to fastidious harvesting, fruit removal and drying than to size of the bean. This coffee was selected and processed under the supervision of Miguel Meza, one of specialty coffee's young visionaries. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii.", "Roast Level:": "Medium-Light", "Agtron:": "55/71", "Est. Price:": "$39.95/16 ounces", "Review Date:": "March 2011", "Aroma:": "10", "Acidity:": "8", "Body:": "8", "Flavor:": "10", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/extra-fancy-kona-coffee-medium-roast/"}, {"rating": "91", "roaster": "Hula Daddy", "title": "Kona Fancy Natural", "blind assessment": "Complications of fruit ferment are rich and complex in both aroma and cup: Deep, sweet, chocolaty molasses and moist pipe tobacco, a round apricot-like fruit, and a powerful suggestion of dusk flowers extend from aroma through a deeply flavor-saturated finish. The richness fades a bit as the cup cools, revealing a shadow composty edge to the ferment, but the main impression of opulence persists.", "notes": "This coffee is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit is removed, as is the case with wet-processed or \"washed\" coffees. Hula Daddy is a boutique coffee farm at the 1,400 foot level of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was selected and processed under the supervision of Miguel Meza, one of specialty coffee's younger visionaries. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii.", "Roast Level:": "Light", "Agtron:": "59/94", "Est. Price:": "$79.95 / 16 oz.", "Review Date:": "March 2010", "Aroma:": "8", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/kona-fancy-natural/"}, {"rating": "92", "roaster": "Hula Daddy", "title": "Mele 100% Kona Coffee", "blind assessment": "An exciting, rather unusual complex of sweet but pungent citrus, nut and flowers animates the profile from aroma through finish. The citrus in particular is complex and engaging, one moment suggesting Meyer lemon, another especially sweet grapefruit. One cup of five we sampled displayed a very slight hint of bitterness; otherwise the rating for this exotic coffee would go higher.", "notes": "A blend of coffees processed by a variety of methods from a range of cultivars grown on the Hula Daddy farm at the 1,400 foot level of the Mount Hualalai volcano near the northern end of the Kona growing district. \"Mele\" is a Hawaiian word meaning song or poetic chant. This coffee was selected and processed under the supervision of Miguel Meza, one of specialty coffee's younger visionaries. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, North Kona growing district, Hawaii.", "Roast Level:": "Medium-Light", "Agtron:": "51/73", "Review Date:": "June 2009", "Aroma:": "8", "Acidity:": "8", "Body:": "7", "Flavor:": "9", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/mele-100-kona-coffee/"}, {"rating": "97", "roaster": "Hula Daddy", "title": "“Kona Sweet” 100% Kona", "blind assessment": "Intense, crisp, molassy sweet aroma: coffee cherry, aromatic wood, dusk flowers. In the cup soft but powerful acidity with a wine, or perhaps better, apple cider nuance. Delicate, silky mouthfeel, very sweet, continued coffee cherry, molasses, nut, aromatic wood, a hint of dusk flowers, all of which suggest at moments the most subtle milk chocolate imaginable. Smooth, clean, lightly flavor-saturated finish.", "notes": "This coffee is a dry-processed or \"natural\" coffee, meaning the beans were dried inside the fruit rather than after the fruit is removed, as is the case with wet-processed or \"washed\" coffees. Hula Daddy is a boutique coffee farm at the 1,400 foot level of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kailua-Kona. This coffee was prepared under the supervision of Miguel Meza, one of specialty coffee's younger visionaries. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "Holualoa, Hawaii", "Roast Level:": "Light", "Agtron:": "62/83", "Review Date:": "December 2008", "Aroma:": "9", "Acidity:": "8", "Body:": "8", "Flavor:": "9", "Aftertaste:": "9", "url": "https://www.coffeereview.com/review/kona-sweet-100-kona/"}, {"rating": "90", "roaster": "Hula Daddy", "title": "100% Kona Private Reserve", "blind assessment": "Gracefully sweet in the aroma, with soft fruit and floral notes. In the cup, sweet-toned acidity, medium body and delicate flavors of blossoming flowers, honey and summer fruit. Very clean finishing with a lingering sweetness.", "notes": "Hula Daddy is a boutique coffee farm at the 1,400 foot level of the Mount Hualalai near the northern end of the Kona growing district, five minutes above the town of Kona. This is a special selection from the upper part of the farm at about the 1,600 foot elevation, with fruit removal by the traditional washed method. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "North Kona growing district, Big Island of Hawaii", "Roast Level:": "Medium-Light", "Agtron:": "54/68", "Review Date:": "December 2008", "Aroma:": "8", "Acidity:": "8", "Body:": "7", "Flavor:": "8", "Aftertaste:": "8", "url": "https://www.coffeereview.com/review/100-kona-private-reserve/"}, {"rating": "90", "roaster": "Hula Daddy", "title": "100% Kona Extra Fancy", "blind assessment": "A simple but sweet, deeply resonant coffee with a big, smooth body and chocolate-toned fruit notes that read as a round, banana-inclined milk chocolate in the aroma. In the cup the chocolate turns toward cocoa and the fruit toward a gently tart, cherryish coffee fruit. Rich, straightforward finish with a very slight hint of astringency.", "notes": "Extra Fancy is the term for the highest grade of Kona coffee based primarily on largest bean size. Hula Daddy is a boutique coffee farm at the 1,400 foot level of the Mount Hualalai volcano near the northern end of the Kona growing district, five minutes above the town of Kona. Visit www.huladaddy.com or call 888-553-2339 for more information.", "bottom line": null, "Roaster Location:": "Holualoa, Hawaii", "Coffee Origin:": "South Kona growing district, \"Big Island\" of Hawaii", "Roast Level:": "Medium", "Agtron:": "49/59", "Review Date:": "March 2007", "Aroma:": "8", "Acidity:": "7", "Body:": "9", "Flavor:": "8", "Aftertaste:": "7", "url": "https://www.coffeereview.com/review/100-kona-extra-fancy/"}]